class Category2TechTabRule:

    """
    技術、製品・サービス、オピニオン・解説、レビュー、イベント・セミナー、政策・行政、社会、提携・協業(仮)
    """

    chage_rule = [
        ["イベント",
            ["イベント", "セミナー", "募集"]],
        ["技術",
            ["技術動向", "技術開発", "研究", "実験", "特許", "技術背景", "採用"]],
        ["政策",
            ["議案", "政府", "税金", "認可", "規制", "要望"]],
        ["製品サービス",
            ["営業活動", "受注", "価格", "価格変更", "サービス", "商品化", "生産活動"]],
        ["社会",
            ["社会", "自然", "法廷", "障害", "問題", "事件", "現象"]],
        ["レビュー",
            ["レビュー", "紹介", "説明"]],
        ["オピニオン",
            ["技術動向", "コラム", "意見", "見解", "提案", "予測"]],
        ["提携",
            ["提携", "買収", "契約", "技術提供"]]
    ]

    detail_rule = [
        ["目標",
            ["方針", "目標", "対策", "戦略", "時制.未来"]],
#        ["トピック",
#            ["資金", "支援", "施策", "効果"]],
        ["レポート",
            ["レポート", "調査"]],
    ]
