class Category2PestRule:

    chage_rule = [
        ["経済",
            ["市場動向", "業界情報", "情報公開", "市場データ", "業績", "支援", "投資", "資金", "生産活動", "営業活動",
             "受注", "価格", "価格変更", "株式概況", "提携", "海外展開", "経済", "買収", "契約", "為替", "サービス", "商品化",
             "対策"]],
        ["政治",
             ["議案", "会議", "対談", "政府", "要請", "税金"]],
        ["技術",
             ["技術動向", "技術開発", "研究", "実験", "特許", "技術背景", "採用", "効果"]],
        ["社会",
             ["社会統計", "社会情勢", "社会問題", "法廷", "表彰"]]
    ]

    detail_rule = [
        ["オピニオン",
            ["コラム", "意見", "見解", "提案"]],
        ["トピック",
            ["説明", "紹介"]],
        ["レポート",
             ["レポート", "調査"]],
        ["予測",
             ["予測"]],
        ["目標",
            ["戦略", "施策", "方針", "目標", "行動変化", "対策"]],
        ["組織",
            ["人事", "組織", "設立", "組織変更"]],
        ["リスク／チャンス",
             ["障害", "問題", "事件", "法廷", "認可", "規制", "提供"]],
        ["イベント",
             ["イベント", "セミナー"]]
    ]
