class Category2TabRule:

    chage_rule = [
        ["イベント",
            ["イベント", "セミナー", "募集"]],
        ["技術",
            ["技術動向", "技術開発", "研究", "実験", "特許", "技術背景", "採用"]],
        ["政治",
            ["議案", "政府", "税金", "認可", "規制", "要望"]],
        ["製品サービス",
            ["営業活動", "受注", "価格", "価格変更", "サービス", "商品化"]],
        ["経済",
            ["生産活動", "市場動向", "業界情報", "情報公開", "市場データ", "業績", "支援", "投資", "資金",
             "株式概況", "提携", "海外展開", "経済", "買収", "契約", "為替", "対策", "提供",
             "人事", "組織", "設立", "組織変更", "戦略", "要請", "相場", "表彰"]],
        ["社会",
            ["社会", "自然", "法廷", "障害", "問題", "事件", "現象"]],
        ["その他",
            ["対談", "会議", "生活", "要請", "スポーツ", "芸能"]],
        ["一般コラム",
            ["コラム", "行動変化"]]
    ]

    detail_rule = [
        ["オピニオン",
            ["コラム", "意見", "見解", "提案", "予測"]],
        ["目標",
            ["方針", "目標", "対策", "戦略"]],
        ["トピック",
            ["説明", "紹介", "施策", "効果"]],
        ["レポート",
            ["レポート", "調査"]],
    ]
