class CategoryRule:
    """
    ニュースカテゴリールール
    """
    # 意見
    iken_dic = [
        "意見", "述べる", "主張", "論ずる", "感想", "声", "興奮", "意欲", "感じる", "感ずる", "指摘"
    ]
    # O-V 規則
    # case # を
    o_v_iken_dic = {"obj": {"感"},
                    "verb": {"覚える", "感じる", "抱く", "感ずる"}
                    }
    # 見解
    kenkai_dic = [
        "見解", "見る", "みる", "思う", "考える", "期待"
    ]
    # 提案
    teian_dic = [
        "提案"
    ]
    modality_teian_dic = [
        "<勧誘>"
    ]
    # 要望
    youbou_dic = [
        "要望*", "求める", "願望", "熱望", "ラブコール", "期待"
    ]
    # O-V 規則
    # case # が
    o_v_youbou_dic = {"obj": {"要望", "ニーズ", "願望", "熱望", "ラブコール", "期待"},
                      "verb": {"高まる", "送られる", "高い", "上がる"}
                      }

    # スポーツ , "打つ", "泳ぐ", "走る", "蹴る"
    sports_dic = [
        "勝利", "敗退", "王手", "対戦", "勝負", "勝敗", "試合", "戦勝", "先勝", "戦敗", "先負", "首位争い", "選手権",
        "勝つ", "負ける", "敗れる", "練習", "強化合宿", "柵超え", "キャンプイン", "制す", "快勝", "敗戦", "得点", "敗退", "塁打",
        "投げる", "スパイク", "シュート", "ドリブル", "ボレー", "スマッシュ", "サーブ", "レシーブ", "ドロー", "ブルペン*",
        "跳ぶ", "跳躍", "スピン", "三振*", "移籍",
        "投手", "開幕戦", "参戦", "逃V", "枠*番"
    ]
    # O-V 規則
    # case # に
    o_v_sports_dic = {"obj": {"戦", "決勝", "トーナメント", "キャンプ", "ローテーション", "ローテ"},
                      "verb": {"進出", "敗退", "入る", "復帰", "調整"}
                      }
    # case # を
    o_v_sports2_dic = {"obj": {"戦", "点", "ポイント", "ラウンド", "シェア", "三振", "ホームラン", "打", "ファーボール", "ヒット",
                               "四球", "死球", "デッドボール", "ゴロ", "ダウン", "ゴール", "バーディ", "パー", "ボギー",
                               "ホールインワン", "イーグル", "アルバトロス", "タッチ", "ゲーム"},
                       "verb": {"奪う", "奪われる"}
                       }
    # case # に
    o_v_sports3_dic = {"obj": {"投球", "打席", "スイング", "ピッチング", "打", "点", "キロ", "三振", "ドロー", "勝", "引き分け"
                               "戦"},
                       "verb": {"視線", "手応え", "調整"}
                       }
    # case # が
    o_v_sports4_dic = {"obj": {"手", "者", "クローザー", "ピッチャー", "助っ人外国人", "チーム", "キャンプ", "メンバー"},
                       "verb": {"記録", "活躍", "合流"}
                       }
    # case # を
    o_v_sports5_dic = {"obj": {"戦", "白星", "黒星", "勝利", "優勝", "追撃", "目標タイム"},
                       "verb": {"飾る", "自信", "届く"}
                       }
    # case # に
    o_v_sports6_dic = {"obj": {"現役*"},
                       "verb": {"幕", "終える", "終止符", "復帰"}
                       }
    # case # の
    o_v_sports7_dic = {"obj": {"登板*", "メニュー"},
                       "verb": {"調整"}
                       }
    # case # を
    o_v_sports8_dic = {"obj": {"ボール", "バット", "クラブ", "珠"},
                       "verb": {"投げる", "蹴る", "打つ", "受ける"}
                       }
    # case # に
    o_v_sports9_dic = {"obj": {"試合", "ゲーム", "イニング", "回", "マッチ"},
                       "verb": {"登板", "出場", "降板", "退場", "復帰", "調整"}
                       }

    # 芸能
    arts_dic = [
        "歌う", "唄う", "謳う", "詠う", "謡う", "唱う", "舞う", "踊る", "演じる", "奏でる", "魅せる", "語り位合う"
        "画く",
        "出演", "共演", "指揮", "セッション", "合奏", "彫刻", "彫像", "熱唱", "熱演", "上映", "結婚", "登板", "復帰", "演出",
        "卒業", "祝福", "DVD化", "CD化", "アニメ化",
        "コンサート", "ステージ", "パフォーマンス", "活動休止", "終幕", "終演", "番組*",
        "制作", "新曲", "アルバム", "あらすじ", "グラビア", "写真集", "ショット",
        "ng[Web制作]"
    ]
    # case # を、の
    o_v_arts_dic = {"obj": {"オファー", "オーディション", "出演", "表紙", "カバー"},
                    "verb": {"受ける", "飾る"}
                    }
    # case # が
    o_v_arts2_dic = {"obj": {"共演者", "事務所"},
                     "verb": {"反論", "移籍"}
                     }
    # case # が
    o_v_arts3_dic = {"obj": {"新曲", "アルバム"},
                     "verb": {"到着"}
                     }
    # case # を
    o_v_arts4_dic = {"obj": {"結婚", "婚約", "離婚", "出産", "流産"},
                     "verb": {"認める", "報告", "発表", "公表", "報告"}
                     }

    # 占い
    fortune_dic = [
        "占い", "運勢"
    ]

    # 生活　（食事、育児、健康）
    seikatsu_dic = [
        "健康*", "フィットネス", "ダイエット", "減塩", "血圧対策", "高血圧",
        "食事*", "栄養*", "食品*", "献立", "メニュー", "料理", "レシピ", "夕食", "弁当", "レストラン", "グルメ",
        "子育て*", "保育*", "養育*", "授業料", "卒業式", "入学式", "入園式",
        "食べる", "育てる", "飲む", "酔っ払う",
        "エレガント"
    ]
    # case # を、の
    o_v_seikatsu_dic = {"obj": {"学校", "高校", "大学", "幼稚園", "保育園"},
                        "verb": {"入学", "卒業", "入園", "卒園"}
                        }

    # イベント
    event_dic = [
        "イベント*", "公開*", "出展*", "展示*", "開催*", "集結*", "会", "催し", "展", "典", "見本市", "第*回*",
        "サミット*", "シンポジューム*", "シンポジウム*", "キャンペーン*", "ライブ*", "プレゼント*", "クランクイン", "クランクアウト",
        "フォーラム*",
        "出演", "勝利", "開幕", "開演", "開場", "講演", "公演", "受験", "申込受付",
        "参加", "出場", "放送", "共演", "実施*", "配布*", "追悼", "ワークショップ*",
        "EXPO",
        "ng[社会]", "ng[協会]", "ng[教会]", "ng[議会]", "ng[照会]", "ng[商会]", "ng[進展]", "ng[発展]",
        "ng[ライブドアニュース]", "ng[ライブラリー]"
    ]
    # O-V 規則
    # case # を、の
    o_v_event_dic = {"obj": {"イベント", "催し", "会", "展", "典", "見本市", "式",
                             "サミット", "シンポジューム", "キャンペーン", "ライブ", "フェア",
                             "Youtube",
                             "CES", "ＣＥＳ",
                             "漁", "花見", "狩", "田植え", "稲刈り", "植え付け", "刈り取り", "収穫",
                             "受付", "入試", "受験"},
                     "verb": {"開催", "案内", "紹介", "開始", "スタート", "実施", "調整", "始まる",
                              "協賛", "参加", "出展", "披露", "中止", "延期", "延長", "お知らせ"},
                     "ng_obj": {"株式", "方式", "会社"}
                     }

    # case # を、の
    o_v_event2_dic = {"obj": {"招待"},
                      "verb": {"受ける"}
                      }

    # セミナー
    seminar_dic = [
        "セミナー", "ウェビナー", "セミナー開催", "ウェビナー開催", "セミナー再開催", "ウェビナー再開催", "聞きいただける",
        "講演", "登壇", "題する"
    ]
    # O-V 規則
    # case # を
    o_v_seminar_dic = {"obj": {"セミナー", "ウェビナー"},
                       "verb": {"考える", "話す", "聞きいただける", "説明", "解説", "読み解く", "受ける",
                                "開催", "催す", "開く", "受講", "視聴", "配信", "登壇", "月", "日"}
                       }

    # コラム
    column_dic = [
        "コラム",
        "なる", "ある", "やる",
        "こと", "ため", "もの",
        "について", "ご覧", "ためし", "あり",
        "知る", "まとめる", "問う", "すすめる", "狙う", "もたらす", "語る", "挑む", "変わる", "学ぶ", "変える", "書く", "狙う",
        "見える", "担う", "わかる", "開く", "応える", "答える", "向ける。", "作る", "触れる", "遊ぶ", "導く", "迫る", "探る",
        "捉える", "役立つ", "読み解く", "支える", "守る", "届ける", "失う", "つくる", "教える", "読む", "明かす", "振り返る",
        "楽しむ", "描く", "見入る", "見せる", "驚く", "盛り上がる", "訴える", "選ぶ", "持つ", "愉しめる", "楽しめる", "思い出す",
        "生み出す", "抜け出す", "作り出す", "引き出す", "迎える", "走る", "決める", "輝く", "語り位合う", "違う", "巡る", "試す",
        "語り合う", "伝える", "高まる", "行く", "告げる", "生まれる",
        "後押し", "進化", "チェック", "連載", "興奮", "解決", "挑戦", "誕生", "影響", "明らかに", "議論", "予想", "革新", "感謝",
        "感激", "感動", "感嘆", "絶賛", "批判", "告白", "活躍", "満喫", "驚愕", "アピール", "歓喜", "発信", "表現", "封印",
        "比較", "進展", "取材", "悪戦苦闘", "苦心", "苦悩", "真実", "内幕", "役割",
        "祝福", "失態", "先行", "期待",
        "さん", "者", "方", "法", "編", "話", "たち", "地", "代", "ぶり",
        "必要", "重要", "続々", "リアル", "現実的", "前途多難", "簡単", "素敵", "有効", "不十分", "便利", "エレガント",
        "日だ", "時間だ", "分だ", "秒だ", "得", "明らか", "ほやほや", "いま", "プライスレス", "不安",
        "last=今",
        "いい", "スゴい",
        "価値", "鍵", "カギ", "ヘッドライン", "ポイント", "世界", "トップ", "意志", "意思", "ステップ", "手法", "主役", "脇役",
        "スペック", "社長", "会長", "まとめ", "NG", "OK", "注意", "先端", "以外", "以上", "理解", "ビジネス", "可能性",
        "課題", "事情", "実力", "コツ", "理由", "要因", "原因", "特徴", "差", "実際", "リスク", "カラクリ", "からくり", "正体",
        "中身", "反響", "思い", "思い出", "視線", "笑顔", "姿", "指導", "手応え", "表情", "別れ", "家族", "末路",
        "訳", "わけ", "ワケ", "構造", "仕組み", "恥", "本腰", "壁", "意識", "全容", "展望", "メカニズム", "賛否", "仕事", "未来",
        "組織", "闇", "道", "道標", "道半ば", "道のり", "道程", "道筋", "分かれ道", "[現実]", "ミス", "失敗", "事実", "現実味",
        "衝撃", "狙い", "現状", "違い", "問題", "力", "話題", "収入", "企業戦略", "特集*", "驚異", "脅威", "裏側", "共通点", "涙",
        "エール", "舞台裏", "並", "オーラ", "自信", "決まり", "別物", "巻き返し", "香り", "アプローチ", "スピード", "要件", "手順",
        "民主化", "最前線", "野心", "取り組み", "本音", "ルール", "気づき", "悲劇",
        "ng[改編]", "ng[取りまとめ]"
    ]
    modality_column_dic = [
        "<疑問>", "<限定>", "<容易>", "<意思・願望>", "<勧誘>", "<試行>", "<困難>", "<感情付与>", "<命令>", "<こと>",
        "<とは>", "<過剰>", "<当然>", "<方向>", "<告知>", "<仮定>", "<意思・願望>",
        "<否定>+<仮定>", "<継続>+<過去>"
    ]
    # O-V 規則
    # case # を
    o_v_column_dic = {"obj": {"経歴"},
                      "verb": {"持つ"}
                      }
    # case # を、の
    o_v_column2_dic = {"obj": {"販売"},
                       "verb": {"担当"}
                       }
    # case # の
    o_v_column3_dic = {"obj": {"驚異"},
                       "verb": {"%"}
                       }
    # case # 文末
    o_v_column4_dic = {"obj": {"どうして", "なぜ"},
                       "verb": {".*"}
                       }
    # case # を、の
    o_v_column5_dic = {"obj": {"進歩", "アナリスト", "新製品", "つ", "人"},
                       "verb": {"予測", "情報"}
                       }
    # case # が、の
    o_v_column6_dic = {"obj": {"教授", "アナリスト", "員", "氏", "家", "相", "官", "紙", "誌", "大臣"},
                       "verb": {"指摘", "情報"}
                       }
    # case # が
    o_v_column7_dic = {"obj": {"結末", "最後", "ラスト", "最終話", "内容", "デザイン", "アンケート"},
                       "verb": {"判明", "発表", "公表", "明らか", "否定"}
                       }
    # case # に
    o_v_column8_dic = {"obj": {"手", "スイッチ"},
                       "verb": {"入る"}
                       }
    # case # が
    o_v_column9_dic = {"obj": {"コメント", "メッセージ", "談話", "空港"},
                       "verb": {"到着"}
                       }
    # V_m 規則
    v_m_column_dic = {"verb": {"披露", "言う"},
                      "modality": {"<受け身>"}
                      }
    v_m_column2_dic = {"verb": {"止まる", "言う", "いる"},
                       "modality": {"<否定>", "<仮定>"}
                       }

    # 説明
    setusmei_dic = [
        "説明", "解説", "について", "事例", "貢献", "狙う", "明かす", "告白", "否定"
    ]

    # 紹介
    shoukai_dic = [
        "紹介", "取り組み", "選"
    ]
    # case # を
    o_v_shoukai_dic = {"obj": {"記事"},
                       "verb": {"選ぶ"}
                       }
    modality_shoukai_dic = [
        "<引用>"
    ]

    # 議案
    gian_dic = [
        "議案", "提出"
    ]
    # O-V 規則
    # case # に、と
    o_v_gian_dic = {"obj": {"争点"},
                    "verb": {"なる"}
                    }

    # 会談
    kaigi_dic = [
        "会談", "聴取", "出席", "議会", "サミット", "シンポジューム", "欠席", "延期", "順延", "情報交換", "協議", "参加調整",
        "会合", "会議", "ワーキンググループ", "タスクホース"
    ]
    # O-V 規則
    # case # を、の
    o_v_kaigi_dic = {"obj": {"会合", "会議", "会談", "議会", "協議", "サミット", "シンポジューム", "会期"},
                     "verb": {"開催", "講演", "拒否", "拒む", "中止", "延期", "延長", "要望", "望む", "開く", "実施", "調整"}
                     }

    # 対談
    taidan_dic = [
        "対談", "聞く", "謝罪", "陳謝"
    ]
    # O-V 規則
    # case # を、の
    o_v_taidan_dic = {"obj": {"対談", "対話"},
                      "verb": {"要望", "望む", "開く", "実施", "調整"}
                      }

    # 予測
    yosoku_dic = [
        "予測", "推定", "見通し", "予想"
    ]
    # O-V 規則
    # case # を、の
    o_v_yosoku_dic = {"obj": {"予測", "推定"},
                      "verb": {"発表", "公表", "公開", "お知らせ", "リリース", "披露", "明らか", "否定"}
                      }

    # 業界情報
    gyoukai_dic = [
        "業界情報", "業界の概要", "正念場", "期間", "リーク", "成長", "重荷", "模索", "高騰", "暴落", "分析", "相次ぐ",
        "警戒", "警告", "評価",
        "存在感", "急務", "広がる", "進む", "遅れる", "続く", "注力", "提唱", "展開", "照準", "位", "倍増", "半減",
        "超える", "参戦", "負ける", "勝つ", "敗れる",
        "攻勢", "内部情報", "主導権争い", "売加速", "市場攻略", "拡大期", "シェア", "勝機", "商機"
    ]
    # O-V 規則
    # case # を、の
    o_v_gyoukai_dic = {"obj": {"業界の概要", "業界情報", "動向"},
                       "verb": {"提供", "公開", "発表", "公表", "説明", "お知らせ", "通知", "披露", "明らか", "否定", "紹介",
                                "交える"}
                       }
    # case # を、の
    o_v_gyoukai2_dic = {"obj": {"支持", "信頼", "評価"},
                        "verb": {"獲得", "左右"}
                        }
    # case # が
    o_v_gyoukai3_dic = {"obj": {"案", "考え", "計画", "事業", "売上", "販売", "武器", "計画"},
                        "verb": {"浮上", "台頭", "前進", "進む", "後退", "衰退", "消滅", "底上げ", "加速", "浸透", "策定"}
                        }

    # 情報公開
    koukai_dic = [
        "情報公開", "報告", "レポート", "開示", "収載", "データ掲載", "データ情報", "披露", "付託表", "通告表", "資料", "マニュアル"
    ]
    # O-V 規則
    # case # を、の
    o_v_koukai_dic = {"obj": {"情報公開", "報告", "レポート", "開示", "データ", "結果", "資料", "マニュアル", "表", "ルート"},
                      "verb": {"発表", "公表", "報告", "レポート", "着手", "行う", "実行", "掲載", "お知らせ", "披露", "明らか", "否定",
                               "公開", "明らか"}
                      }

    # 情報提供
    teikyou_dic = [
        "得情報", "優待情報", "特別情報", "PR", "ＰＲ"
    ]
    # O-V 規則
    # case # を、の
    o_v_teikyou_dic = {"obj": {"情報"},
                       "verb": {"提供", "サービス", "届ける", "到着"}
                       }

    # レポート, "調査"
    report_dic = [
        "レポート*", "レポ", "記", "マップ", "ランキング", "ベスト", "体験", "レビュー", "体感",
        "トップ1*", "トップ2*", "トップ3*", "トップ4*", "トップ5*", "トップ6*", "トップ7*", "トップ8*", "トップ9*",
        "トップ１*", "トップ２*", "トップ３*", "トップ４*", "トップ５*", "トップ６*", "トップ７*", "トップ８*", "トップ９*",
        "TOP1*", "TOP2*", "TOP3*", "TOP4*", "TOP5*", "TOP6*", "TOP7*", "TOP8*", "TOP9*",
        "TOP１*", "TOP２*", "TOP３*", "TOP４*", "TOP５*", "TOP６*", "TOP７*", "TOP８*", "TOP９*",
        "選", "位", "本",
        "1点", "2点", "3点", "4点", "5点", "6点", "7点", "8点", "9点", "0点",
        "１点", "２点", "３点", "４点", "５点", "６点", "７点", "８点", "９点", "０点",
        "報告書", "リスト",
        "ng[ウェブニュースランキング]", "ng[日本]"
    ]
    # O-V 規則
    # case # を、の
    o_v_report_dic = {"obj": {"レポート", "マップ", "白書", "ランキング", "ベスト", "トップ", "結果", "データ", "ポートフォリオ",
                              "報告書", "数値", "リスト"},
                      "verb": {"発表", "公表", "報告", "レポート", "リリース", "レポート", "掲載", "お知らせ", "披露",
                               "20", "２０", "年",
                               "明らか", "否定", "到着"}
                      }

    # 市場データ
    shijyou_dic = [
        "市場データ*", "市場の見通し*", "市場調査*", "情報源", "％増", "％減", "%増", "%減"
    ]
    # O-V 規則
    # case # に、は、が
    o_v_shijyou_dic = {"obj": {"割合", "率", "％", "%", "量", "台", "人", "数", "額", "倍"},
                       "verb": {"とどまる", "倍", "割", "前進", "達する", "算出", "持ち直す", "記録"},
                       "ng_obj": {"台湾", "舞台"},
                       "ng_verb": {"役割"}
                       }
    # case # を、に
    o_v_shijyou2_dic = {"obj": {"円", "ドル", "トン", "％", "%", "割", "台", "人", "年", "倍", "資金"},
                        "verb": {"超える", "前進", "達する", "減速", "記録", "水準", "損出", "消失", "記録"}
                        }
    # case # が、は
    o_v_shijyou3_dic = {"obj": {"市場", "マーケット", "期", "数", "量", "販売", "減", "増", "客", "給与", "賞与"},
                        "verb": {"円", "ドル", "トン", "％", "%", "割", "台", "人",
                                 "円超", "ドル超", "トン超", "％超", "%超", "割超", "台超", "人超",
                                 "円増", "ドル増", "トン増", "％増", "%増", "割増", "台増", "人増",
                                 "円減", "ドル減", "トン減", "％減", "%減", "割減", "台減", "人減",
                                 "円以上", "ドル以上", "トン以上", "％以上", "%以上", "割以上", "台以上", "人以上",
                                 "円以下", "ドル以下", "トン以下", "％以下", "%以下", "割以下", "台以下", "人以下",
                                 "円未満", "ドル未満", "トン未満", "％未満", "%未満", "割未満", "台未満", "人未満",
                                 "調査", "報告", "レポート"},
                        "ng_verb": {"台湾", "舞台", "けが人"},
                        }

    # 市場動向(販売マーケット)
    shikyou_dic = [
        "市況", "市場動向", "推移", "市場", "見込み", "暗雲", "好評", "不評", "好調", "不調", "伸び悩む", "貿易*", "経済*",
        "利上げ", "利下げ", "首位争い", "ユニコーン", "販路*"
    ]
    # O-V 規則
    # case # が、は
    o_v_shikyou_dic = {"obj": {"販売", "売上", "シェア", "ユーザー", "需要", "生産", "収穫", "漁獲", "貿易", "市場", "販路",
                               "マーケット"},
                       "verb": {"好調", "不調", "いい", "悪い", "下落", "上昇", "獲得", "打撃", "減退", "最高", "最低",
                                "拡大", "縮小", "維持", "影", "左右"}
                       }
    # case # が
    o_v_shikyou2_dic = {"obj": {"人気", "好調", "不調", "影響力"},
                        "verb": {"要因", "原因", "理由", "わけ", "明らか", "否定", "影", "左右"}
                        }
    # case # を、の
    o_v_shikyou3_dic = {"obj": {"市場", "拡大", "縮小", "成長", "後退", "収益", "需要", "雇用", "増", "減", "超",
                                "販売", "生産", "収穫", "漁獲", "売上", "シェア", "ユーザー"},
                        "verb": {"見込む", "予測", "予想", "記録", "明らか", "否定", "奪う", "実現", "影", "左右"}
                        }
    # case # を、の、に
    o_v_shikyou4_dic = {"obj": {"物価高", "利上げ", "利下げ"},
                        "verb": {"見込む", "予測", "予想", "記録", "直面", "人気", "嫌気", "左右"}
                        }
    # 社会統計
    toukei_dic = {
        "量*％", "量*%", "率*％", "率*%", "％減少*", "%減少*", "％増加*", "%増加*", "低水準", "高水準", "割", "割超",
        "突破", "超える", "超え", "上回る", "下回る", "上回り", "下回り", "未満", "最多", "最多タイ", "最小", "最大",
        "数*人", "志願状況", "人中*人", "%達成"
    }
    # O-V 規則
    # case # が、は、より
    o_v_toukei_dic = {"obj": {"量", "率", "数", "度", "比", "費", "額", "者", "客", "差", "％", "%", "トン",
                              "PMI", "ＰＭＩ", "超",
                              "先週", "前週", "先月", "前月", "昨年", "前年"},
                      "verb": {"増", "減", "増える", "減る", "低下", "上昇", "水準", "最高", "最低", "増加", "減少",
                               "微増", "微減", "横ばい", "拡大", "縮小", "明らか", "否定", "一致", "達成"}
                      }
    # case # が、は
    o_v_toukei2_dic = {"obj": {"量", "率", "歳", "度", "比", "費", "額", "人", "男性", "女性"},
                       "verb": {"％", "%", "割", "トン"}
                       }
    # case # が
    o_v_toukei3_dic = {"obj": {"人中*人"},
                       "verb": {"用いる", "利用", "活用", "搭乗", "乗車"}
                       }
    # case # を
    o_v_toukei4_dic = {"obj": {"人", "メートル"},
                       "verb": {"記録"}
                       }

    # 政府・予算
    yosan_dic = [
        "関税", "納税", "財政*"
    ]
    # O-V 規則
    o_v_yosan_dic = {"obj": {"予算", "税務", "課税", "税優遇"},
                     "verb": {"決定", "検討", "変更", "要請", "合意", "一致", "実行", "強化", "提出", "要求"}
                     }
    o_v_yosan2_dic = {"obj": {"関税", "予算"},
                      "verb": {"トン", "円"}
                      }
    o_v_yosan3_dic = {"obj": {"ファンド", "税措置"},
                      "verb": {"設ける", "設置", "決定", "行う"}
                      }
    # 政府・補助金
    hojoyokin_dic = [
        "拠出", "ファンド", "融資", "資金提供", "補助", "値差補填", "補助金", "補助*要望"
    ]
    # O-V 規則
    o_v_hojoyokin_dic = {"obj": {"補助金", "補助", "援助", "救済", "助成"},
                         "verb": {"下げる", "上げる", "増加", "削減", "減少", "打ち切る", "出す", "増額",
                                  "採択", "延長", "充実", "拡充", "決定", "始まる", "始める", "一致"}
                         }
    # O-V 規則
    o_v_hojoyokin2_dic = {"obj": {"政府*", "党", "内閣", "助成*", "援助*", "救済*"},
                          "verb": {"支援", "出資", "負担", "投資"}
                          }
    # 政府・行革
    gyoukaku_dic = [
        "行革", "政策", "指示"
    ]
    # O-V 規則
    # case # を、の、が
    o_v_gyoukaku_dic = {"obj": {"政府", "党", "内閣", "行政", "政策", "庁", "省", "国", "県", "都", "北海道", "府", "市", "区", "町", "村",
                                "ガイドライン"},
                        "verb": {"推進", "変革", "見直す", "懸念", "慎重", "失敗", "改革", "改正", "改訂", "最終調整",
                                 "蓄積", "改編", "革新"}
                        }

    # 政府・認可
    ninnka_dic = [
        "認可", "承認", "認定", "検定通過", "申請", "了承", "容認", "受理"
    ]
    # O-V 規則
    # case # を
    o_v_ninnka_dic = {"obj": {"認可", "承認", "要請", "認定", "了承"},
                      "verb": {"出す", "取得", "始める", "進める", "行う", "実行", "懸念", "拒否", "拒む", "要望", "依頼", "一致"}
                      }
    # case # を
    o_v_ninnka2_dic = {"obj": {"機器", "装置", "建築", "建設", "開発", "販売", "製造", "組織", "薬品",
                               "権利", "ライセンス", "免許", "資格",
                               "同性婚", "主張"},
                       "verb": {"認める", "一致", "了承"}
                       }

    # 政府・規制
    kisei_dic = [
        "規制", "禁輸", "禁止", "解禁", "禁足", "禁令", "法改正", "緩和", "抑制", "基準作り", "義務化", "法案", "法整備", "法整備*"
    ]
    # O-V 規則
    # case # を、の
    o_v_kisei_dic = {"obj": {"規則", "規制", "制限", "願い", "制限", "制度", "法律", "法改正", "法案", "改正*"},
                     "verb": {"出す", "発行", "始める", "進める", "行う", "実行", "見直す", "施行", "懸念",
                              "一致", "打撃", "検討", "盛り込む"}
                     }
    # case # を、の、が
    o_v_kisei2_dic = {"obj": {"政府", "党", "内閣", "行政", "政策", "庁", "省", "国", "県", "都", "北海道", "府", "市", "区", "町", "村"},
                      "verb": {"制限", "義務"},
                      }

    # 政府活動・宣言
    sengen_dic = [
        "政府活動", "禁固", "声明", "妥協", "告示", "要請", "政府*報告", "政府原案", "政府方針"
    ]
    # O-V 規則
    # case # が、は
    o_v_sengen_dic = {"obj": {"政府", "党", "内閣", "相", "大統領", "大臣", "答弁", "百条委", "自衛隊",
                              "官", "庁", "省", "委", "国", "県", "都", "北海道", "府", "市", "区", "町", "村"},
                      "verb": {"出す", "発表", "公表", "報告", "レポート", "リリース", "お知らせ", "披露", "主張", "明らか", "修正",
                               "否定", "判断", "表明", "非難", "指示", "支持", "宣言", "確約", "提携", "計画", "支援", "抗議",
                               "危機感", "認める", "評価", "報告書", "要求", "創設", "拒絶", "号令", "構築", "警戒", "採用",
                               "提供", "調査", "注意", "求める", "新設", "措置", "奮起", "検討", "発足", "策謀", "展開", "設立",
                               "売却", "協定", "模索", "策定", "連携", "選定", "表彰", "掲載", "前倒し", "要望", "舵", "集約",
                               "後押し", "優遇", "狙う", "調達", "担う", "役割", "提言", "育成", "警告", "起用", "申し入れ"},
                      "ng_obj": {"都市", "都心", "町田", "田町", "佑都", "市場", "市内", "朝市"},
                      "ng_verb": {"描き出す"}
                      }
    # case # を
    o_v_sengen2_dic = {"obj": {"日米", "日中", "日韓", "日露"},
                       "verb": {"継続", "見直す"}
                       }
    # case # を
    o_v_sengen3_dic = {"obj": {"国防"},
                       "verb": {"排除"}
                       }
    # case # を
    o_v_sengen4_dic = {"obj": {"報告", "方策"},
                       "verb": {"求める", "要求", "示す"}
                       }
    # 政府活動・会談
    kaidan_dic = [
        "外交", "外遊",
        "派遣", "表敬", "訪れる", "訪問", "立ち合う", "視察", "出張", "参加", "出席", "視察",
        "議論", "意見交換", "反論", "交渉", "審議", "閣議決定", "協議"
    ]
    # O-V 規則
    # case # を
    o_v_kaidan_dic = {"obj": {"表敬", "訪問", "来訪", "視察", "出張", "参加", "出席", "視察", "外交"},
                      "verb": {"受ける", "応酬"}
                      }
    # case # を、に
    o_v_kaidan2_dic = {"obj": {"委員会", "会議", "議会", "会合", "分科会", "会談", "交渉", "検討会",
                               "コンソーシアム", "ワーキング・グループ"},
                       "verb": {"開催", "開く", "臨む", "出席", "到着", "出発", "始める", "始まる", "一致", "設置",
                                "協議", "合意", "進展", "設置", "設立"}
                       }
    # case # が、は
    o_v_kaidan3_dic = {"obj": {"政府", "党", "内閣", "庁", "省", "相", "大統領", "大臣"},
                       "verb": {"訪問", "訪れる", "訪ねる", "出席", "到着", "出発", "覚書", "締結", "合意", "会議"}
                       }

    # 要請
    yousei_dic = [
        "要請", "要求", "求める", "頼む", "依頼", "申請", "申告"
    ]

    # 法廷
    houtei_dic = [
        "提訴", "起訴", "告訴", "原告", "被告", "裁判", "調停", "逮捕", "拘留", "勝訴", "敗訴", "和解", "示談", "保釈",
        "検挙"
    ]

    # 募集
    bosyuu_dic = [
        "募集*", "入札*", "申込み*"
    ]
    # O-V 規則
    # case # を、の
    o_v_bosyuu_dic = {"obj": {"募集", "入札", "申込み", "公募"},
                      "verb": {"発表", "公表", "報告", "レポート", "お知らせ", "情報", "明らか", "否定"}
                      }

    # 契約
    keiyaku_dic = [
        "合意", "協議", "決裂", "契約", "結ぶ", "締結", "覚書", "交わす", "協定"
    ]
    # O-V 規則
    # case # を、の
    o_v_keiyaku_dic = {"obj": {"合意", "一致", "協議", "契約", "締結", "協定"},
                       "verb": {"発表", "公表", "報告", "レポート", "お知らせ", "意欲", "結ぶ", "明らか", "否定"}
                       }

    # 表彰
    jyushou_dic = [
        "優勝", "受賞", "表彰", "授与", "選出", "ノミネート", "選定", "認定", "最高賞"
    ]
    # O-V 規則
    # case # を、の
    o_v_jyushou_dic = {"obj": {"賞", "アワード", "論文", "評価", "位", "作品", "選考"},
                       "verb": {"発表", "公表", "受ける", "授かる", "もらう", "与える", "採択", "獲得", "お知らせ", "披露",
                                "明らか", "否定", "決定", "通過",
                                "氏", "教授", "員"}
                       }
    # V_m 規則
    v_m_jyushou_dic = {"verb": {"選ぶ", "選出"},
                       "modality": {"<受け身>"}
                       }

    # 障害
    shougai_dic = [
        "恐れ", "懸念", "トラブル", "障害*", "吹き飛ぶ", "露呈", "事故", "故障", "ストップ", "停止", "切断", "直面", "行き詰まる",
        "傷害", "起こる", "発生", "欠陥", "弱点*", "バグ", "脆弱*", "リスク", "バグ", "感染", "未着火", "衝突", "危険", "警鐘",
        "失敗", "音信不通", "流出*"
    ]
    # O-V 規則
    # case # が、は、の
    o_v_shougai2_dic = {"obj": {"トラブル", "障害", "事故", "故障", "切断", "傷害", "欠陥", "パスワード", "弱点", "バグ",
                                "脆弱性", "リスク", "危険", "原因", "流出"},
                        "verb": {"発生", "起こる", "明らか", "否定"}
                        }
    # case # に
    o_v_shougai3_dic = {"obj": {"選択", "離脱", "帰国", "危険"},
                        "verb": {"直面"}
                        }
    # case # が、は
    o_v_shougai4_dic = {"obj": {"性能", "機能", "リソース", "数", "員", "入", "出", "円", "ドル"},
                        "verb": {"不十分", "不安定", "足りない", "不足"}
                        }
    # case # を
    o_v_shougai5_dic = {"obj": {"視界", "機能", "リソース", "数", "員", "入", "出"
                                "シェア", "視線", "祖国", "ふる里",
                                "時間", "マイク", "全て", "すべて"},
                        "verb": {"奪う", "奪われる"}
                        }
    # case # を、が
    o_v_shougai6_dic = {"obj": {"懸念", "危機感", "危険性", "緊張", "警戒", "危機", "危険", "リスク"},
                        "verb": {"表明", "示す", "感じる", "高まる"}
                        }

    modality_shougai_dic = {
        "<否定>+<可能>"
    }

    # 技術動向
    gijyutudoukou_dic = [
        "存在感", "主流", "注目", "進化", "開発中"
    ]
    # O-V 規則
    # case # が
    o_v_gijyutudoukou_dic = {"obj": {"技術", "研究", "開発"},
                             "verb": {"先行", "進む", "遅れる", "求める"}
                             }
    # case # を、の

    # 技術提供
    gijyututeikyou_dic = [
        "提供", "開放", "オープン化"
    ]

    # 技術開発 , "早い", "軽い", "重い"
    kaihatsu_dic = [
        "用いる", "減らす", "増やす", "標的にする", "防ぐ", "打ち上げる", "打ち上がる",
        "開発", "設計", "確立", "変換", "向上", "改善", "実現", "成功", "削減", "可能", "着目", "効率", "創出",
        "技術発表",
        "合成", "化合", "着色", "加熱", "冷却", "制御", "対応", "発見", "解明", "貢献", "搭載", "観測", "[サポート]",
        "応用", "活用", "技術誕生", "検出", "搭載", "アップデート", "生成", "合成", "実装", "駆動", "再現", "再生", "拡張",
        "リサイクル", "測量", "測定", "測位", "観測", "観察", "計測", "反応", "統合", "結合", "融合", "確認", "作製", "短縮",
        "改良", "改善", "補正", "改修", "駆使", "デザイン", "防止", "阻止", "抑止", "搭載", "代替", "軽減", "入力", "解消",
        "適用", "通信", "制御", "補正", "抑制", "添加", "吸着",
        "検知", "検出", "特定", "判明", "拡大,", "集積", "調節", "促進", "移植", "手術", "総整理", "転写", "延長",
        "業界最高", "開発中", "機能付き",
        "速い", "遅い", "明るい", "暗い", "正しい", "使える",
        "軽量", "高速", "スムーズ",
        "特性", "アルゴリズム", "方式", "化合物", "材料", "素材", "半導体", "金属", "成分", "ソリューション",
        "導入事例", "抗菌性",
        "装置", "機器", "機械", "技術", "学習", "機構",
        "センシング", "シールド", "ペースト",
        "化", "剤", "物", "薬", "機",
        "サーバー", "カメラ", "アプリ", "ツール", "デバイス", "ディスプレイ", "コア", "ルーター", "ロボット*", "モデルハウス", "ナビ*",
        "AI", "テレビ", "人工知能",
        "ng[本格化]", "ng[民主化]", "ng[DVD化]", "ng[CD化]", "ng[帯化]", "ng[アニメ化]", "ng[映画化]", "ng[ソフト化]",
        "ng[有料化]", "ng[拠点化]",
        "ng[別物]"
    ]
    # O-V 規則
    # case # を、の
    o_v_kaihatsu_dic = {"obj": {"％", "トン", "キロ", "ミリ"},
                        "verb": {"削減", "増加", "増量", "減少", "化", "以上", "以下"}
                        }
    # case # を、の
    o_v_kaihatsu2_dic = {"obj": {"技術", "世界最", "設計", "要件", "仕様", "スペック", "全容", "詳細", "全貌", "性能", "機能",
                                 "仕組み", "メカニズム", "方法", "アプローチ", "方式", "研究", "開発", "探索", "メソッド", "関数"},
                         "verb": {"発表", "公表", "お知らせ", "披露", "リリース", "解決", "明らか", "否定", "考案", "切り替え",
                                  "登場", "拡大", "別物", "追いつく"}
                         }
    # case # の
    o_v_kaihatsu3_dic = {"obj": {"開発"},
                         "verb": {"知見"}
                         }
    # case # を、の
    o_v_kaihatsu4_dic = {"obj": {"サーバー", "カメラ", "アプリ", "ツール", "デバイス", "ディスプレイ", "コア", "ロボット", "ルーター",
                                 "ドローン", "モデルハウス", "ChatGPT", "プラットフォーム",
                                 "装置", "機器", "機械", "技術", "回路", "図", "設計",
                                 "センシング", "シールド",
                                 "パスワード",
                                 "剤", "物", "薬", "機"
                                 },
                         "verb": {"発表", "公表", "お知らせ", "披露", "恐れ", "可能性", "明らか", "否定", "使う", "活かす",
                                  "もたらす", "完成"}
                         }
    # case # が。は
    o_v_kaihatsu5_dic = {"obj": {"AI", "人工知能", "機械"},
                         "verb": {"生み出す", "生成", "作成", "作る", "創造"}
                         }
    # case # が、は
    o_v_kaihatsu6_dic = {"obj": {"度", "燃費", "距離", "スピード"},  # 解像度,精度...
                         "verb": {"％", "%", "トン", "キロ", "ミリ", "秒", "分", "時間", "リットル", "馬力", "HP",
                                  "以上", "以下", "上回る", "下回る"},
                         "ng_obj": {"移動距離"}
                         }
    # case # が
    o_v_kaihatsu7_dic = {"obj": {"機能"},
                         "verb": {"入る"}
                         }
    # case # を
    o_v_kaihatsu8_dic = {"obj": {"星", "銀河", "太陽", "地球", "宇宙", "ロケット", "地表"},
                         "verb": {"発表", "公表", "お知らせ", "披露", "明らか"}
                         }
    # 研究開発
    kenkyuu_dic = [
        "研究開発", "研究", "共同研究", "観測", "観察", "計測", "検証", "講究", "考査", "分析", "攻究", "考究", "研学",
        "考察", "探求", "研究結果",
        "研磨", "討究", "発見"
    ]
    # O-V 規則
    # case # を、の
    o_v_kenkyuu_dic = {"obj": {"論文", "ペーパー"},
                       "verb": {"発表", "公表", "採択", "お知らせ", "披露", "明らか", "否定"}
                       }
    # case # を、の
    o_v_kenkyuu2_dic = {
        "obj": {"こと", "現象", "試験", "実験", "研究", "探求", "実証", "減少", "増加", "生成", "解析", "性", "効果",
                "量", "値", "メカニズム", "関連", "関係", "方法", "アプローチ", "末路", "習慣", "謎", "像",
                "状態", "性能", "役割", "理由", "要因", "原因", "特徴", "実態", "構造", "形状"},
        "verb": {"確認", "解明", "究明", "解析", "検証", "披露", "明らか", "否定", "不十分"}
    }
    # case # に、を
    o_v_kenkyuu3_dic = {"obj": {"研究", "究明", "解明", "解析", "検証", "分析"},
                        "verb": {"着手", "開始", "スタート", "参画", "披露", "明らか", "否定", "不十分"}
                        }
    # case # に
    o_v_kenkyuu4_dic = {"obj": {"研究", "究明", "解明", "解析", "方法", "アプローチ", "検証", "実現", "化", "形", "開発", "実験"},
                        "verb": {"道", "光", "望み", "希望", "前進", "光を当てる"}
                        }

    # 調査
    chousa_dic = [
        "調査*", "調べる", "検証", "点検", "検見", "検査", "詮索", "探検", "漁り", "捜査", "[サーチ]",
        "探索", "探訪", "捜索", "検索", "調べ", "鑑定", "吟味", "検分", "査問", "査閲", "訊問", "確認", "定検"
    ]
    # case # で、により
    o_v_chousa_dic = {"obj": {"観測", "計測", "測定", "検証", "点検", "検見", "検査", "詮索", "探検", "漁り", "捜査",
                              "探索", "探訪", "捜索", "検索", "調べ", "鑑定", "吟味", "検分", "査問", "調査",
                              "査閲", "訊問", "アンケート"},
                      "verb": {"解明", "明らか", "否定", "判明", "実施"}
                      }
    # 実験
    jikken_dic = [
        "実験*", "実証実験", "実証事業", "試作*", "試験*", "テスト*", "実証", "デモ*", "治験*",
        "ng[試験販売]"
    ]
    # O-V 規則
    # case # を、の
    o_v_jikken_dic = {"obj": {"実験", "実証実験", "試作", "試験", "テスト", "実証"},
                      "verb": {"発表", "公表", "開始", "スタート", "実施", "調整", "実行", "参画", "お知らせ", "披露",
                               "明らか", "否定"},
                      "ng_obj": {"試験販売"},
                      "ng_verb": {"試験販売"}
                      }

    # 特許
    tokkyo_dic = [
        "出願", "登録", "権利化"
    ]
    # O-V 規則
    # case # を、の
    o_v_tokkyo_dic = {"obj": {"特許", "権利", "意匠権", "明細書"},
                      "verb": {"発表", "公表", "公開", "訴訟", "裁判", "登録", "争う", "公表", "お知らせ", "披露", "明らか", "否定",
                               "取得"}
                      }

    # 業績
    gyouseki_dic = [
        "業績", "上方修正", "下方修正", "増収", "減収", "増益", "減益", "黒字", "赤字", "利益", "決算", "売上",
        "最高益", "円達成", "ドル達成",
        "営業益*", "経常益*",
        "決算*"
    ]
    # O-V 規則
    # case # を、の
    o_v_gyouseki_dic = {"obj": {"業績", "売上", "益", "損失", "予想", "受注", "販売", "実績"},
                        "verb": {"発表", "公表", "計上", "円", "押し上げる", "上回る", "お知らせ", "披露", "最高", "最低",
                                 "明らか", "否定", "届く", "達成",
                                 "暗",
                                 "円", "ドル", "トン", "％", "%", "割", "台", "人"
                                 },
                        "ng_verb": {"舞台", "人気"}
                        }
    # case # を、の
    o_v_gyouseki2_dic = {"obj": {"黒字", "赤字", "増益", "減益", "増収", "減収", "受注", "契約", "売上", "利益"},
                         "verb": {"見込み", "見込む", "見通し", "予想", "予測", "獲得", "設定", "記録"}
                         }

    # 経営戦略
    senryaku_dic = [
        "経営戦略", "戦略", "計略", "計画", "中計", "長計", "[シフト]", "[チェンジ]", "前倒し", "前倒", "後ろ倒し", "後ろ倒", "先送り"
    ]
    # O-V 規則
    # case # に、を
    o_v_senryaku_dic = {"obj": {"事業", "人員", "工数", "経費", "予算", "リソース", "コスト"},
                        "verb": {"集める", "集中", "削減"}
                        }
    # case # を、の
    o_v_senryaku2_dic = {"obj": {"事業", "プロジェクト", "取り組み", "戦略", "スキーム", "コスト", "開発"},
                         "verb": {"始める", "開始", "スタート", "実施", "調整", "実行", "構築", "参画", "明らか", "否定",
                                  "重点", "加速"}
                         }

    # 施策
    sisaku_dic = [
        "施策", "策定"
    ]

    # 方針
    housin_dic = [
        "方針", "据える", "加速", "発掘", "打ち出す", "振り向ける", "図る", "目指す", "高める", "充実", "能力増と", "増強",
        "見込みです", "強化", "決定", "進める", "上げる", "応ずる", "転換", "始動", "示す", "掲げる", "突入", "関心", "決意", "表明",
        "明らかにする", "宣言", "念頭", "推進", "増加", "減少", "拡大", "縮小", "提唱", "展開", "整備", "[シフト]", "[チェンジ]",
        "意向", "コンセプト", "現実路線", "視野", "捨てる", "焦点を当てる", "描く", "意欲", "判断", "重点"
    ]
    # O-V 規則
    # case # を、の
    o_v_housin_dic = {"obj": {"方針", "対応", "取り組み", "取り扱い", "循環", "リサイクル", "化", "制度", "コンセプト",
                              "基準", "計画", "戦略", "指標", "開発"},
                      "verb": {"表明", "発表", "公表", "開始", "スタート", "実施", "調整", "実行", "参画", "めど", "お知らせ", "披露", "適用",
                               "明らか", "否定", "加速"},
                      "ng_obj": {"変化"}
                      }
    # case # を
    o_v_housin2_dic = {"obj": {"調査"},
                       "verb": {"表明", "開始", "スタート", "実施", "調整", "実行", "参画", "めど", "加速"}
                       }

    # 目標
    mokuhyou_dic = [
        "目標", "目指す", "見通し", "つなげる", "念頭", "未達", "達成", "めど", "目処", "向ける"
    ]
    # case # を、の
    o_v_mokuhyou_dic = {"obj": {"目標", "計画", "戦略", "指標"},
                        "verb": {"設定", "発表", "公表"}
                        }
    # case # を、の
    o_v_mokuhyou2_dic = {"obj": {"量", "類", "数", "排出"},
                         "verb": {"ゼロ"}
                         }
    modality_mokuhyou_dic = [
        "<目標>"
    ]

    # 行動変化
    hennka_dic = [
        "変革"
    ]

    # 企業活動（対策）
    taisaku_dic = [
        "対策", "備える", "措置"
    ]
    # O-V 規則
    # case # を、の
    o_v_taisaku_dic = {"obj": {"対策", "準備", "備え", "策", "措置"},
                       "verb": {"行う", "実行"}
                       }

    # 採用利用
    riyou_dic = [
        "採用", "利用", "活用", "導入", "供給", "採択", "投入", "購入", "発注", "納入"
    ]

    # 支援
    sien_dic = [
        "支援", "出資", "協賛", "スポンサー", "サポート", "約束", "クラウドファンディング", "寄付", "贈与", "贈呈", "寄贈", "義援金"
    ]
    # case # を、の
    o_v_sien_dic = {"obj": {"支援", "出資", "協賛", "スポンサー", "サポート", "約束", "クラウドファンディング", "寄付",
                            "義援金", "贈与", "贈呈", "寄贈"},
                    "verb": {"行う", "実行", "募集", "要望", "要求", "お願い", "依頼"}
                    }

    # 投資
    tousi_dic = [
        "投資*", "出資", "交付", "億円", "兆円", "前払い"
    ]
    # O-V 規則
    # case # が、は、を、に
    o_v_tousi_dic = {"obj": {"投資", "出資"},
                     "verb": {"円", "ドル", "ユーロ", "ポンド", "元",
                              "実行", "行う", "懸念", "取りやめる", "約束", "中止", "撤退", "継続", "拡大"}
                     }

    # 資金調達
    sikin_dic = [
        "資金調達", "債券", "調達", "増資", "財源", "償還", "受領", "出資受け入れ", "シリーズB", "シリーズA", "シリーズC",
        "ファーストクローズ"
    ]
    # case # を
    o_v_sikin_dic = {"obj": {"債権"},
                     "verb": {"発行"}
                     }

    # サービス開始
    service_dic = [
        "サービス開始", "参入", "導入確定", "提供", "追加", "復活", "着手", "運用", "[リリース]", "誕生", "開設",
        "開業", "出店", "発行", "発刊",
        "出版", "放映", "参画", "オープン", "スタート", "皮切り", "サービス",
        "キャッシュバック"
    ]
    # O-V 規則
    # case # を、の
    o_v_service_dic = {"obj": {"サービス", "提供", "サイト", "ホームページ", "ＨＰ", "取扱", "販売", "事業", "場", "」",
                               "決済", "システム", "運用", "リリース", "レンタル", "ツアー", "貸出", "貸し出し", "発電",
                               "乗車", "搭乗", "受付", "受け入れ", "プログラム", "ナビゲーション", "アプリ"},
                       "verb": {"開始", "スタート", "始める", "オープン", "参入", "実施", "試せる"}
                       }
    o_v_service2_dic = {"obj": {"クーポン"},
                        "verb": {"配布"}
                        }
    o_v_service3_dic = {"obj": {"サービス"},
                        "verb": {"採用"}
                        }

    # サービス変更
    koushin_dic = [
        "サービス変更", "更新", "改修", "リニューアル", "再提供", "復活", "再開", "再放送", "精度アップ", "精度改善", "刷新",
        "休刊", "改装"
    ]
    # O-V 規則
    # case # を、の
    o_v_koushin_dic = {"obj": {"サービス", "提供", "サイト", "ホームページ", "ＨＰ", "取扱", "販売", "事業", "場", "」",
                               "決済", "システム", "運用", "リリース", "精度"},
                       "verb": {"更新", "改修", "リニューアル", "再提供", "復活", "再開", "再放送", "アップ", "見直す", "一新"}
                       }

    # サービス終了
    end_dic = [
        "サービス終了", "終了", "撤退", "中止", "廃止", "閉鎖", "停止", "閉業", "延期", "閉店", "休止", "打ち切り"
    ]
    # O-V 規則
    # case # を、の
    o_v_end_dic = {"obj": {"サービス", "提供", "サイト", "ホームページ", "ＨＰ", "取扱", "販売", "事業", "場", "」",
                           "決済", "システム", "運用", "リリース", "生産", "歴史"},
                   "verb": {"終了", "撤退", "中止", "廃止", "閉鎖", "幕"},
                   "ng_verb": {"内幕"}
                   }

    # 生産開始
    seisan_dic = [
        "生産*", "製造*", "減産", "増産", "量産*", "輸送*", "稼働"
    ]
    # O-V 規則
    # case # を、の
    o_v_seisan_dic = {"obj": {"生産", "量産", "製造", "運転", "運用", "稼働"},
                      "verb": {"開始", "スタート", "始める"}
                      }
    # V_m 規則
    v_m_seisan_dic = {"verb": {"生産", "量産", "製造", "運転", "運用", "稼働"},
                      "modality": {"<目標>"}
                      }

    # 商品化
    shouhin_dic = [
        "商品化", "製品化", "商用展開", "市場投入", "販売*", "発売*", "登録", "新*発表", "製品発表", "商品発表", "登場",
        "プロトタイプ発表", "限定*台", "提供開始", "提供中", "通販", "新作",
        "出荷", "デビュー", "新*製品", "新*サービス", "新*商品", "ローンチ", "新*ブランド"
    ]
    # O-V 規則
    # case # に、を
    o_v_shouhin_dic = {"obj": {"市場", "製品", "商品", "サービス", "販売", "発売", "新型", "最新", "対応", "料理",
                               "ツール", "システム", "期型"},
                       "verb": {"投入", "発表", "公表", "お知らせ", "披露", "明らか", "否定", "公開"}
                       }
    # case # を、の
    o_v_shouhin2_dic = {"obj": {"オプション", "製品", "商品", "サービス", "対応", "ハイブリッド", "新", "EV", "HV", "PHEV",
                                "ラインナップ"},
                        "verb": {"設定"}
                        }

    # 営業活動
    eigyou_dic = [
        "配信", "放映", "広告", "宣伝", "営業", "コナーシャル", "販促", "休暇"
    ]
    # O-V 規則
    # case # を、の
    o_v_eigyou_dic = {"obj": {"CM", "ＣＭ"},
                      "verb": {"開始", "スタート", "始める"}
                      }

    # 受注
    jyutyuu_dic = [
        "受注", "契約", "締結"
    ]

    # 価格変更
    price_change_dic = [
        "価格変更", "値上げ", "値下げ", "円オフ"
    ]
    # O-V 規則
    # case # を、の
    o_v_price_change_dic = {"obj": {"価格", "料金", "円", "ドル"},
                            "verb": {"アップ", "ダウン", "変更", "見直し", "上昇", "割引", "最高", "最低", "改定"}
                            }
    # case # は、が
    o_v_price_change2_dic = {"obj": {"引き上げる", "引き下げる"},
                             "verb": {"ドル", "円", "ポンド", "ユーロ"}
                             }

    # 価格
    price_dic = [
        "価格", "料金", "費用", "コスト", "特価"
    ]
    # O-V 規則 する
    # case # に、と
    o_v_price_dic = {"obj": {"円", "ドル", "ユーロ"},
                     "verb": {"なる", "からとなる", "からとする", "いう", "からという"}
                     }
    # case # が、は
    o_v_price2_dic = {"obj": {"価格", "料金", "費用", "コスト", "セール"},
                      "verb": {"円", "ドル", "ユーロ", "元", "視野", "実現"}
                      }

    # 税金
    zeikin_dic = [
        "増税*", "減税*", "引き上げ", "引き下げ", "関税*"
    ]
    # O-V 規則
    # case # を、の
    o_v_zeikin_dic = {"obj": {"増税", "減税", "税金", "税", "関税"},
                      "verb": {"行う", "見直す", "直面", "回避", "検討", "引き上げる", "引き下げる", "免除"}
                      }

    # 相場
    souba_dic = [
        "相場", "建値", "現値", "建日", "買い建て", "売り建て", "値洗い", "買い建て玉", "売り建て玉"
    ]
    # O-V 規則
    # case # が
    o_v_souba_dic = {"obj": {"建値", "先物"},
                     "verb": {"円", "ドル"}
                     }
    # 為替
    kawase_dic = [
        "円高*", "円安*", "ドル高*", "ドル安*", "ユーロ高*", "ユーロ安*", "ポンド高*", "ポンド安*",
        "円売り*", "円買い*", "ドル売り*", "ドル買い*", "ユーロ売り*", "ユーロ買い*", "ポンド売り*", "ポンド買い*",
        "金利*", "総裁", "為替", "金融市場", "ＲＭ１", "＄1", "rm1",
        "エクスポージャー"
    ]
    # O-V 規則
    # case # が
    o_v_kawase_dic = {"obj": {"発言"},
                      "verb": {"支え", "きっかけ"}
                      }
    # case # が
    o_v_kawase2_dic = {"obj": {"エクスポージャー"},
                       "verb": {"最低", "最高"}
                       }

    # 株式概況
    kabu_dic = [
        "株価", "株式市場", "高値", "安値", "小幅高", "ストップ高", "ストップ安", "反発", "不成立", "急落", "急伸", "続落",
        "続伸", "反落",
        "大幅高", "小動き", "株主総会", "高騰", "暴落", "銘柄", "堅調", "%高", "%安", "％高", "％安",
        "0円安", "1円安", "2円安", "3円安", "4円安", "5円安", "6円安", "7円安", "8円安", "9円安",
        "０円安", "１円安", "２円安", "３円安", "４円安", "５円安", "６円安", "７円安", "８円安", "９円安",
        "0円高", "1円高", "2円高", "3円高", "4円高", "5円高", "6円高", "7円高", "8円高", "9円高",
        "０円高", "１円高", "２円高", "３円高", "４円高", "５円高", "６円高", "７円高", "８円高", "９円高",
        "0ドル安", "1ドル安", "2ドル安", "3ドル安", "4ドル安", "5ドル安", "6ドル安", "7ドル安", "8ドル安", "9ドル安",
        "０ドル安", "１ドル安", "２ドル安", "３ドル安", "４ドル安", "５ドル安", "６ドル安", "７ドル安", "８ドル安", "９ドル安",
        "0ドル高", "1ドル高", "2ドル高", "3ドル高", "4ドル高", "5ドル高", "6ドル高", "7ドル高", "8ドル高", "9ドル高",
        "０ドル高", "１ドル高", "２ドル高", "３ドル高", "４ドル高", "５ドル高", "６ドル高", "７ドル高", "８ドル高", "９ドル高",
        "銭安", "銭高", "銘柄*", "配当*", "行使", "単価", "相場", "弱含み", "強含み", "買い優勢", "売り優勢"
    ]
    # case # が、は
    o_v_kabu_dic = {"obj": {"株価", "初値", "終値", "公開価格", "高値", "安値", "単価", "東証", "大証"},
                    "verb": {"円", "ドル", "ユーロ",
                             "上昇", "下落", "引き上げ", "引き下げ", "付ける", "上回る", "下回る", "つける", "最高", "最低",
                             "更新", "記録"}
                    }
    # case # を
    o_v_kabu2_dic = {"obj": {"円", "ドル", "ユーロ"},
                     "verb": {"付ける", "つける", "嫌気"}
                     }
    # case # を、で
    o_v_kabu3_dic = {"obj": {"取引", "円", "ドル", "ユーロ", "一段高", "二段高", "三段高", "一段安", "二段安", "三段安",
                             "上放れ", "下放れ"},
                     "verb": {"終える", "始める", "始まる"}
                     }
    # case # に
    o_v_kabu4_dic = {"obj": {"投資家"},
                     "verb": {"求める", "懸念"}
                     }
    # case # が、は
    o_v_kabu5_dic = {"obj": {"上値", "下値"},
                     "verb": {"重い", "軽い"}
                     }
    # case # を、の
    o_v_kabu6_dic = {"obj": {"相場"},
                     "verb": {"指摘", "見込む", "予想", "記録", "終わる"}
                     }
    # case # が、に
    o_v_kabu7_dic = {"obj": {"売り", "買い", "注文", "高値水準", "安値水準", "反発", "下落", "暴落", "暴騰"},
                     "verb": {"入る", "嫌気", "受ける", "記録"}
                     }

    # 人事
    jinnji_dic = [
        "人事*", "任命", "解任", "退任", "就任", "異動", "指名", "起用", "人事異動"
    ]
    # case # を
    o_v_jinnji_dic = {"obj": {"給与", "年俸", "ボーナス", "賞与", "報酬", "幹部", "役員"},
                      "verb": {"設定", "改定", "改正", "導入"}
                      }
    # case # を
    o_v_jinnji2_dic = {"obj": {"給与", "年俸", "ボーナス", "賞与", "起用", "採用", "活用"},
                       "verb": {"考慮", "受諾", "一新"}
                       }
    # case # が、を
    o_v_jinnji3_dic = {"obj": {"名", "人", "人材", "チーム", "グループ"},
                       "verb": {"選考", "誕生", "任命", "採用", "流出"}
                       }
    # case # を
    o_v_jinnji4_dic = {"obj": {"人事異動"},
                       "verb": {"お知らせ"}
                       }

    # 組織
    sosiki_dic = [
        "組織", "設ける", "設置", "体制"
    ]

    # 業務提携
    teikei_dic = [
        "提携", "連携", "協業", "加入", "共同研究", "継承", "協力", "共力", "共有", "供与", "社共同", "加盟",
        "0社", "1社", "2社", "3社", "4社", "5社", "6社", "7社", "8社", "9社",
        "０社", "１社", "２社", "３社", "４社", "５社", "６社", "７社", "８社", "９社",
        "コラボ", "コラボレーション"
    ]
    # O-V 規則
    # case # を、の
    o_v_teikei_dic = {"obj": {"技術"},
                      "verb": {"吸収"}
                      }
    # case # を、の
    o_v_teikei2_dic = {"obj": {"提携", "連携", "協業", "共同研究", "共同開発研究"},
                       "verb": {"開始", "スタート", "行う", "実行", "実施", "調整", "実行", "着手", "参画"}
                       }

    # M&A
    manda_dic = [
        "買収", "売却", "譲渡", "M&A", "吸収", "合併", "併合", "株式交換", "公開買付", "TOB", "ＴＯＢ",
        "分割型分割", "第三者割当増資", "MBO", "合弁企業の設立", "MEBO", "株式移転", "新設分割", "現物出資", "スピンアウト",
        "捌く", "売りわたす", "売渡す", "鬻ぐ", "譲る"
    ]
    # O-V 規則
    # case # を
    o_v_manda_dic = {"obj": {"企業", "会社", "部門", "事業", "サービス", "組織"},
                     "verb": {"買う", "売る", "譲る", "売却", "捌く", "売りわたす", "売渡す", "鬻ぐ", "販売", "譲る"}
                     }

    # 組織設立
    seturitu_dic = [
        "組織設立", "会社設立", "会設立", "所設立", "部設立", "課設立", "場設立", "店設立", "委員設立", "敷く", "発足",
        "プロジェクト開始", "新会社", "設立", "創設"
    ]
    # O-V 規則
    # case # を、の
    o_v_seturtu_dic = {"obj": {"組織", "チーム", "プロジェクト", "会社", "カンパニー",
                               "部", "課", "所", "場", "店", "会", "委員", "センター", "ラボ"},
                       "verb": {"新設", "発足", "設立", "開設", "構築", "創設"}
                       }
    # case # を、の
    o_v_seturtu2_dic = {"obj": {"プロジェクト"},
                        "verb": {"開始", "スタート"}
                        }

    # 組織変更
    sohen_dic = [
        "組織変更", "部門変更", "部門統合", "組織統合", "社名変更", "継承", "分社", "会社分割", "分社化", "人削減", "商号変更"
    ]
    # O-V 規則
    # case # を、に
    o_v_sohen_dic = {"obj": {"部", "課", "組織", "部門", "チーム", "プロジェクト", "カンパニー", "所", "場", "店", "センター",
                             "ラボ", "体制", "コーポレート", "体制", "ブループ"},
                     "verb": {"変更", "移行", "廃止", "改称", "統合", "刷新", "一新", "導入"}
                     }
    # case # を、が、の
    o_v_sohen2_dic = {
        "obj": {"組織変更", "部門変更", "部門統合", "組織統合", "社名変更", "継承", "分社", "会社分割", "分社化"},
        "verb": {"浮上", "出る", "判明", "発表", "公表", "検討", "視野", "明らか", "否定"}
    }

    # 海外展開
    kaigai_dic = [
        "海外展開", "進出"
    ]
    # case # を
    o_v_kaigai_dic = {"obj": {"国事業", "海外", "国外", "外国", "欧米", "アジア", "ヨーロッパ", "中国", "ロシア", "日本*展開"},
                      "verb": {"めざす", "目指す", "展開", "拡大", "縮小", "撤退", "本格化"}
                      }

    # 設備
    setubi_dic = [
        "竣工", "着工", "起工", "建設", "建設中", "設置", "構築", "構築中", "新築", "新設", "閉鎖", "移転", "配備",
        "設備", "供給拠点", "生産拠点", "新拠点", "新工場", "新オフィース", "ライン", "新棟", "ターミナル", "拠点"
    ]
    # O-V 規則
    # case # を、の
    o_v_setubi_dic = {"obj": {"所", "場", "店", "センター", "ラボ", "施設", "オフィース", "ビル", "プラント", "ライン", "設備",
                              "拠点", "ターミナル"},
                      "verb": {"構築", "拠点", "増強", "新設", "着工", "竣工", "建てる", "建設", "誕生", "完成",
                               "切り替え", "廃止", "移動", "始動", "稼働"}
                      }
    # case # を、の
    o_v_setubi2_dic = {"obj": {"生産能力", "生産速度", "拠点", "事業"},
                       "verb": {"増強", "増やす", "加速", "拡大"}
                       }
    # case # を、の
    o_v_setubi3_dic = {"obj": {"構築", "拠点", "着工", "竣工", "起工", "建てる", "建設", "閉鎖", "移転"},
                       "verb": {"決定"}
                       }
    # case # が。は
    o_v_setubi4_dic = {"obj": {"建設"},
                       "verb": {"円", "ドル", "ユーロ", "元"}
                       }

    # 技術背景
    gijyutsu_dic = [
        "技術背景", "伴う"
    ]

    # 社会事件
    jiken_dic = [
        "事件", "遺体", "死亡", "死去", "感染", "誹謗", "中傷",
        "略奪", "汚職", "事故", "殺人", "拘束", "逮捕", "検挙", "送検", "監禁", "誘拐", "爆破", "攻撃", "砲撃", "銃撃", "射殺",
        "殺害", "救出", "避難", "非難", "略奪", "撃墜", "脅威", "渋滞", "被害", "浮気*", "疑惑",
        "押し入る", "刺す", "殴る", "叩く", "蹴飛ばす", "撃つ", "迷惑被る", "拡散", "行方不明", "消息不明",
        "闘争", "逃走", "保釈", "贈賄", "収賄", "賄賂", "疑い", "火事", "強盗", "発射", "虐待", "失態", "強盗", "けが人なし",
        "落下", "墜落", "撃沈", "撃墜", "崩落", "罪", "判決", "告発", "応酬"
    ]
    # O-V 規則
    # case # に
    o_v_jiken_dic = {"obj": {"捜査", "捜索", "控訴審", "訴訟", "裁判", "調査", "事件"},
                     "verb": {"入る", "始まる", "受ける"}
                     }
    # case # が、から
    o_v_jiken2_dic = {"obj": {"遺体", "遺留品", "証拠", "焼け跡", "者", "現金", "煙"},
                      "verb": {"見つかる", "上がる"}
                      }
    # case # が、を
    o_v_jiken3_dic = {"obj": {"事件", "疑い", "関与", "起訴", "罪", "贈賄", "収賄", "賄賂", "不備", "訴え", "不適切", "虐待"},
                      "verb": {"抱える", "起きる", "発生", "明らか", "否定", "認める"}
                      }
    # case # が、は
    o_v_jiken4_dic = {"obj": {"けが人", "死人", "意識不明", "死亡", "倒壊"},
                      "verb": {"なし", "人", "棟"}
                      }
    # case # を
    o_v_jiken5_dic = {"obj": {"金", "円", "強盗", "バック", "車", "バイク", "命", "生活", "仕事", "夫", "妻", "財布", "家",
                              "家族", "祖国", "ふる里",
                              "宝石", "貴金属"},
                      "verb": {"奪う", "奪われる"}
                      }

    # 社会問題
    mondai_dic = [
        "問題", "課題", "悩み", "困りごと", "困り事", "温暖化", "脱炭素", "脱二酸化炭素", "異常", "障害", "災",
        "災い", "差別", "貧困",
        "格差", "難民", "災害", "水衛生", "人権", "ギャップ", "人身売買", "児童労働", "紛争*", "戦争*", "内戦*", "侵攻*",
        "侵略*", "感染*", "汚染",
        "害", "不足", "気候変動", "ＳＤＧｓ", "SDGs", "ＬＧＢＴ", "LGBT", "ＬＧＢＴＱ", "LGBTQ", "マイノリティー",
        "自給自足", "脅威", "カーボンニュートラル",
        "地震", "台風", "津波", "ハリケーン", "大雪", "大雨", "豪雨", "豪雪", "乾燥", "倒壊", "軍事利用", "難路",
        "関係改善", "被害", "ウラン濃縮度", "人口減少", "脱中国",
        "浮き彫り", "人削減*", "武器売却*", "政権転覆*", "処理水*"
    ]
    # O-V 規則
    # case # を、の
    o_v_mondai_dic = {"obj": {"問題", "課題", "悩み", "困りごと", "困り事", "不十分", "現状", "影響",
                              "環境", "汚染", "時間", "実態", "状況", "ストレス"},
                      "verb": {"抱える", "起きる", "発生", "明らか", "否定", "増加", "減少"}
                      }
    # case # が
    o_v_mondai2_dic = {"obj": {"問題", "課題", "悩み", "困りごと", "困り事", "脱炭素"},
                       "verb": {"高まる", "浮き彫り", "浮き彫りになる"}
                       }
    # case # を、の
    o_v_mondai3_dic = {"obj": {"マイノリティー", "カーボンニュートラル"},
                       "verb": {"支援", "サポート", "要望", "達成", "案"}
                       }
    # case # を
    o_v_mondai4_dic = {"obj": {"排出量"},
                       "verb": {"ゼロ", "削減"}
                       }

    # 社会情勢　, "先行"
    shakai_dic = [
        "社会情勢", "懸念*", "変動", "物価高", "物価安", "寡占", "減速", "打撃", "出遅れ",
        "増加中", "減少中", "悪戦苦闘"
    ]
    # O-V 規則
    # case # を、に、の
    o_v_shakai_dic = {"obj": {"物価高", "物価安", "高", "安", "後退", "格差", "負荷", "不十分",
                              "成果", "価格", "報告", "構造", "問題", "対策",
                              "団体"},
                      "verb": {"拍車", "鈍化", "指摘", "本腰", "生まれる", "取り組む"}
                      }
    # case # に
    o_v_shakai2_dic = {"obj": {"社会", "経済", "企業", "問題", "世界"},
                       "verb": {"起きる", "発生", "いま", "生まれる", "取り組む"}
                       }
    # case # を
    o_v_shakai3_dic = {"obj": {"取り組み"},
                       "verb": {"始める", "開始", "検討", "スタート", "行う", "実行", "実施", "調整", "実行", "着手"}
                       }

    # 自然環境
    kankyou_dic = [
        "猛暑", "豪雪", "暖冬", "猛暑", "豪雨", "地震", "温暖化", "ハリケーン", "台風", "津波", "噴火", "水不足"
    ]
    # O-V 規則
    # case # が
    o_v_kankyou_dic = {"obj": {"気温", "雨", "雪", "台風", "地震", "津波", "豪雨", "水不足"},
                       "verb": {"上がる", "下がる", "降る", "多い", "少ない", "起きる", "干上がる"}
                       }
    # case # が
    o_v_kankyou2_dic = {"obj": {"山"},
                        "verb": {"爆発"}
                        }

    # 前提
    zentei_dic = [
        "前提", "踏まえる", "不可欠"
    ]

    # 現象
    gensyou_dic = [
        "現象", "減少", "増加", "遅れる", "早まる"
    ]

    # 効果
    kouka_dic = [
        "効果", "果たす", "分離", "異なる", "低減", "発揮", "高性能", "減らせる", "増やせる", "両立"
    ]

    # 背景
    haikei_dic = [
        "背景", "けん引", "主流", "格好", "課題がある", "動き出す", "深刻化"
    ]
    # V_m 規則
    v_m_haikei_dic = {"verb": {"影響", "長期化", "滞る", "減る", "増える", "迫る", "響く", "更新", "超える", "遅れる"},
                      "modality": {"<過去>"}
                      }
    # O-V 規則
    # case # に
    o_v_haikei_dic = {"obj": {"事業", "業績"},
                      "verb": {"影響", "響く", "左右"},
                      }
    # case # 連接
    o_v_haikei2_dic = {"obj": {"広い"},
                       "verb": {"使用"},
                       }
    # case # が、は、の
    o_v_haikei3_dic = {"obj": {"問題"},
                       "verb": {"起きる", "発生"},
                       }

    ###############################################################################

    # 政府
    seifu_dic = [
        "省", "庁", "政府", "党", "内閣", "相", "大統領", "長官", "閣僚", "出馬", "選挙", "当選", "落選", "法令*", "政策*", "高官"
    ]
    # case # が、に
    o_v_seifu_dic = {"obj": {"省", "庁", "政府", "党", "内閣", "相", "大統領", "政権", "閣僚", "官僚"},
                     "verb": {"起きる", "起こる", "発生", "発表", "公表", "明らか", "否定", "期待", "不安"},
                     }
    # case # に、は、が
    o_v_seifu2_dic = {"obj": {"選挙", "出馬"},
                      "verb": {"有望", "絶望", "多難", "難しい", "公表", "否定"},
                      }
    # 経済
    keizai_dic = [
        "マーケティング", "事業", "輸出大国", "輸入大国", "成長戦略"
    ]

    ####################################################################################

    """
    カテゴリ処理の対象になる格
    """
    category_analyze_case = ["を", "に", "にも", "の", "について", "などに", "などを", "なども", "に対して", "に関して",
                             "までを", "も", "にて", "でも", "が", "として", "は", "により", "で",
                             "され", "ましたので", "れましたので", "では", "から", "と", "と-副詞的",
                             "て-副詞的", "への", "連接", "へ", "など", "は", "などが", "などで", "などは",
                             "までが", "までも", "までで", "より", "よりも", "よりは", "には", "とは", "とともに",
                             "って", "まで", "との", "からの", "-副詞的", "か", "が(連体)", "-連体修飾", "での",
                             "までと", "をも", "もの", "からは", "により-副詞的", "だが", "などへの", "などと"
                             ]

    phrase_rule = [
        {"label": "<意見>", "words": iken_dic},
        {"label": "<意見>", "rule": o_v_iken_dic},
        {"label": "<見解>", "words": kenkai_dic},
        {"label": "<提案>", "words": teian_dic},
        {"label": "<提案>", "modality": modality_teian_dic},
        {"label": "<要望>", "words": youbou_dic},
        {"label": "<要望>", "rule": o_v_youbou_dic},

        {"label": "<スポーツ>", "words": sports_dic},
        {"label": "<スポーツ>", "rule": o_v_sports_dic},
        {"label": "<スポーツ>", "rule": o_v_sports2_dic},
        {"label": "<スポーツ>", "rule": o_v_sports3_dic},
        {"label": "<スポーツ>", "rule": o_v_sports4_dic},
        {"label": "<スポーツ>", "rule": o_v_sports5_dic},
        {"label": "<スポーツ>", "rule": o_v_sports6_dic},
        {"label": "<スポーツ>", "rule": o_v_sports7_dic},
        {"label": "<スポーツ>", "rule": o_v_sports8_dic},
        {"label": "<スポーツ>", "rule": o_v_sports9_dic},
        {"label": "<芸能>", "words": arts_dic},
        {"label": "<芸能>", "rule": o_v_arts_dic},
        {"label": "<芸能>", "rule": o_v_arts2_dic},
        {"label": "<芸能>", "rule": o_v_arts3_dic},
        {"label": "<芸能>", "rule": o_v_arts4_dic},
        {"label": "<占い>", "words": fortune_dic},
        {"label": "<生活>", "words": seikatsu_dic},
        {"label": "<生活>", "rule": o_v_seikatsu_dic},

        {"label": "<イベント>", "words": event_dic},
        {"label": "<イベント>", "rule": o_v_event_dic},
        {"label": "<イベント>", "rule": o_v_event2_dic},
        {"label": "<セミナー>", "words": seminar_dic},
        {"label": "<セミナー>", "rule": o_v_seminar_dic},
        {"label": "<コラム>", "words": column_dic},
        {"label": "<コラム>", "modality": modality_column_dic},
        {"label": "<コラム>", "rule": o_v_column_dic},
        {"label": "<コラム>", "rule": o_v_column2_dic},
        {"label": "<コラム>", "rule": o_v_column3_dic},
        {"label": "<コラム>", "rule": o_v_column4_dic},
        {"label": "<コラム>", "rule": o_v_column5_dic},
        {"label": "<コラム>", "rule": o_v_column6_dic},
        {"label": "<コラム>", "rule": o_v_column7_dic},
        {"label": "<コラム>", "rule": o_v_column8_dic},
        {"label": "<コラム>", "rule": o_v_column9_dic},
        {"label": "<コラム>", "rule": v_m_column_dic},
        {"label": "<コラム>", "rule": v_m_column2_dic},
        {"label": "<説明>", "words": setusmei_dic},
        {"label": "<紹介>", "words": shoukai_dic},
        {"label": "<紹介>", "rule": o_v_shoukai_dic},
        {"label": "<紹介>", "modality": modality_shoukai_dic},

        {"label": "<議案>", "words": gian_dic},
        {"label": "<議案>", "rule": o_v_gian_dic},
        {"label": "<会議>", "words": kaigi_dic},
        {"label": "<会議>", "rule": o_v_kaigi_dic},
        {"label": "<対談>", "words": taidan_dic},
        {"label": "<対談>", "rule": o_v_taidan_dic},

        {"label": "<業界情報>", "words": gyoukai_dic},
        {"label": "<業界情報>", "rule": o_v_gyoukai_dic},
        {"label": "<業界情報>", "rule": o_v_gyoukai2_dic},
        {"label": "<業界情報>", "rule": o_v_gyoukai3_dic},
        {"label": "<予測>", "words": yosoku_dic},
        {"label": "<予測>", "rule": o_v_yosoku_dic},
        {"label": "<情報公開>", "words": koukai_dic},
        {"label": "<情報公開>", "rule": o_v_koukai_dic},
        {"label": "<情報提供>", "words": teikyou_dic},
        {"label": "<情報提供>", "rule": o_v_teikyou_dic},
        {"label": "<レポート>", "words": report_dic},
        {"label": "<レポート>", "rule": o_v_report_dic},
        {"label": "<市場データ>", "words": shijyou_dic},
        {"label": "<市場データ>", "rule": o_v_shijyou_dic},
        {"label": "<市場データ>", "rule": o_v_shijyou2_dic},
        {"label": "<市場データ>", "rule": o_v_shijyou3_dic},
        {"label": "<市場動向>", "words": shikyou_dic},
        {"label": "<市場動向>", "rule": o_v_shikyou_dic},
        {"label": "<市場動向>", "rule": o_v_shikyou2_dic},
        {"label": "<市場動向>", "rule": o_v_shikyou3_dic},
        {"label": "<市場動向>", "rule": o_v_shikyou4_dic},
        {"label": "<社会統計>", "words": toukei_dic},
        {"label": "<社会統計>", "rule": o_v_toukei_dic},
        {"label": "<社会統計>", "rule": o_v_toukei2_dic},
        {"label": "<社会統計>", "rule": o_v_toukei3_dic},
        {"label": "<社会統計>", "rule": o_v_toukei4_dic},

        {"label": "<政府・予算>", "words": yosan_dic},
        {"label": "<政府・予算>", "rule": o_v_yosan_dic},
        {"label": "<政府・予算>", "rule": o_v_yosan2_dic},
        {"label": "<政府・予算>", "rule": o_v_yosan3_dic},
        {"label": "<政府・補助金>", "words": hojoyokin_dic},
        {"label": "<政府・補助金>", "rule": o_v_hojoyokin_dic},
        {"label": "<政府・補助金>", "rule": o_v_hojoyokin2_dic},
        {"label": "<政府・行革>", "words": gyoukaku_dic},
        {"label": "<政府・行革>", "rule": o_v_gyoukaku_dic},
        {"label": "<政府・認可>", "words": ninnka_dic},
        {"label": "<政府・認可>", "rule": o_v_ninnka_dic},
        {"label": "<政府・認可>", "rule": o_v_ninnka2_dic},
        {"label": "<政府・規制>", "words": kisei_dic},
        {"label": "<政府・規制>", "rule": o_v_kisei_dic},
        {"label": "<政府・規制>", "rule": o_v_kisei2_dic},
        {"label": "<政府・宣言>", "words": sengen_dic},
        {"label": "<政府・宣言>", "rule": o_v_sengen_dic},
        {"label": "<政府・宣言>", "rule": o_v_sengen2_dic},
        {"label": "<政府・宣言>", "rule": o_v_sengen3_dic},
        {"label": "<政府・宣言>", "rule": o_v_sengen4_dic},
        {"label": "<政府・会談>", "words": kaidan_dic},
        {"label": "<政府・会談>", "rule": o_v_kaidan_dic},
        {"label": "<政府・会談>", "rule": o_v_kaidan2_dic},
        {"label": "<政府・会談>", "rule": o_v_kaidan3_dic},

        {"label": "<要請>", "words": yousei_dic},
        {"label": "<募集>", "words": bosyuu_dic},
        {"label": "<募集>", "rule": o_v_bosyuu_dic},
        {"label": "<契約>", "words": keiyaku_dic},
        {"label": "<契約>", "rule": o_v_keiyaku_dic},
        {"label": "<法廷>", "words": houtei_dic},

        {"label": "<技術動向>", "words": gijyutudoukou_dic},
        {"label": "<技術動向>", "rule": o_v_gijyutudoukou_dic},
        {"label": "<技術提供>", "words": gijyututeikyou_dic},
        {"label": "<技術開発>", "words": kaihatsu_dic},
        {"label": "<技術開発>", "rule": o_v_kaihatsu_dic},
        {"label": "<技術開発>", "rule": o_v_kaihatsu2_dic},
        {"label": "<技術開発>", "rule": o_v_kaihatsu3_dic},
        {"label": "<技術開発>", "rule": o_v_kaihatsu4_dic},
        {"label": "<技術開発>", "rule": o_v_kaihatsu5_dic},
        {"label": "<技術開発>", "rule": o_v_kaihatsu6_dic},
        {"label": "<技術開発>", "rule": o_v_kaihatsu7_dic},
        {"label": "<技術開発>", "rule": o_v_kaihatsu8_dic},
        {"label": "<研究>", "words": kenkyuu_dic},
        {"label": "<研究>", "rule": o_v_kenkyuu_dic},
        {"label": "<研究>", "rule": o_v_kenkyuu2_dic},
        {"label": "<研究>", "rule": o_v_kenkyuu3_dic},
        {"label": "<研究>", "rule": o_v_kenkyuu4_dic},
        {"label": "<調査>", "words": chousa_dic},
        {"label": "<調査>", "rule": o_v_chousa_dic},
        {"label": "<実験>", "words": jikken_dic},
        {"label": "<実験>", "rule": o_v_jikken_dic},

        {"label": "<障害>", "words": shougai_dic},
        {"label": "<障害>", "rule": o_v_shougai2_dic},
        {"label": "<障害>", "rule": o_v_shougai3_dic},
        {"label": "<障害>", "rule": o_v_shougai4_dic},
        {"label": "<障害>", "rule": o_v_shougai5_dic},
        {"label": "<障害>", "rule": o_v_shougai6_dic},
        {"label": "<障害>", "modality": modality_shougai_dic},

        {"label": "<表彰>", "words": jyushou_dic},
        {"label": "<表彰>", "rule": o_v_jyushou_dic},
        {"label": "<表彰>", "rule": v_m_jyushou_dic},
        {"label": "<特許>", "words": tokkyo_dic},
        {"label": "<特許>", "rule": o_v_tokkyo_dic},

        {"label": "<業績>", "words": gyouseki_dic},
        {"label": "<業績>", "rule": o_v_gyouseki_dic},
        {"label": "<業績>", "rule": o_v_gyouseki2_dic},

        {"label": "<戦略>", "words": senryaku_dic},
        {"label": "<戦略>", "rule": o_v_senryaku_dic},
        {"label": "<戦略>", "rule": o_v_senryaku2_dic},
        {"label": "<施策>", "words": sisaku_dic},
        {"label": "<方針>", "words": housin_dic},
        {"label": "<方針>", "rule": o_v_housin_dic},
        {"label": "<方針>", "rule": o_v_housin2_dic},
        {"label": "<目標>", "words": mokuhyou_dic},
        {"label": "<目標>", "rule": o_v_mokuhyou_dic},
        {"label": "<目標>", "rule": o_v_mokuhyou2_dic},
        {"label": "<目標>", "modality": modality_mokuhyou_dic},
        {"label": "<行動変化>", "words": hennka_dic},
        {"label": "<対策>", "words": taisaku_dic},
        {"label": "<対策>", "rule": o_v_taisaku_dic},

        {"label": "<提携>", "words": teikei_dic},
        {"label": "<提携>", "rule": o_v_teikei_dic},
        {"label": "<提携>", "rule": o_v_teikei2_dic},
        {"label": "<譲渡・買収>", "words": manda_dic},
        {"label": "<譲渡・買収>", "rule": o_v_manda_dic},
        {"label": "<利用・採用>", "words": riyou_dic},

        {"label": "<支援>", "words": sien_dic},
        {"label": "<支援>", "rule": o_v_sien_dic},
        {"label": "<投資>", "words": tousi_dic},
        {"label": "<投資>", "rule": o_v_tousi_dic},
        {"label": "<資金>", "words": sikin_dic},
        {"label": "<資金>", "rule": o_v_sikin_dic},

        {"label": "<サービス開始>", "words": service_dic},
        {"label": "<サービス開始>", "rule": o_v_service_dic},
        {"label": "<サービス開始>", "rule": o_v_service2_dic},
        {"label": "<サービス開始>", "rule": o_v_service3_dic},
        {"label": "<サービス更新>", "words": koushin_dic},
        {"label": "<サービス更新>", "rule": o_v_koushin_dic},
        {"label": "<サービス終了>", "words": end_dic},
        {"label": "<サービス終了>", "rule": o_v_end_dic},
        {"label": "<生産活動>", "words": seisan_dic},
        {"label": "<生産活動>", "rule": o_v_seisan_dic},
        {"label": "<生産活動>", "rule": v_m_seisan_dic},
        {"label": "<商品化>", "words": shouhin_dic},
        {"label": "<商品化>", "rule": o_v_shouhin_dic},
        {"label": "<商品化>", "rule": o_v_shouhin2_dic},
        {"label": "<営業活動>", "words": eigyou_dic},
        {"label": "<営業活動>", "rule": o_v_eigyou_dic},
        {"label": "<受注>", "words": jyutyuu_dic},

        {"label": "<価格変更>", "words": price_change_dic},
        {"label": "<価格変更>", "rule": o_v_price_change_dic},
        {"label": "<価格変更>", "rule": o_v_price_change2_dic},
        {"label": "<価格>", "words": price_dic},
        {"label": "<価格>", "rule": o_v_price_dic},
        {"label": "<価格>", "rule": o_v_price2_dic},

        {"label": "<税金>", "words": zeikin_dic},
        {"label": "<税金>", "rule": o_v_zeikin_dic},

        {"label": "<相場>", "words": souba_dic},
        {"label": "<相場>", "rule": o_v_souba_dic},

        {"label": "<為替>", "words": kawase_dic},
        {"label": "<為替>", "rule": o_v_kawase_dic},
        {"label": "<為替>", "rule": o_v_kawase2_dic},

        {"label": "<株式概況>", "words": kabu_dic},
        {"label": "<株式概況>", "rule": o_v_kabu_dic},
        {"label": "<株式概況>", "rule": o_v_kabu2_dic},
        {"label": "<株式概況>", "rule": o_v_kabu3_dic},
        {"label": "<株式概況>", "rule": o_v_kabu4_dic},
        {"label": "<株式概況>", "rule": o_v_kabu5_dic},
        {"label": "<株式概況>", "rule": o_v_kabu6_dic},
        {"label": "<株式概況>", "rule": o_v_kabu7_dic},

        {"label": "<人事>", "words": jinnji_dic},
        {"label": "<人事>", "rule": o_v_jinnji_dic},
        {"label": "<人事>", "rule": o_v_jinnji2_dic},
        {"label": "<人事>", "rule": o_v_jinnji3_dic},
        {"label": "<人事>", "rule": o_v_jinnji4_dic},
        {"label": "<組織>", "words": sosiki_dic},
        {"label": "<設立>", "words": seturitu_dic},
        {"label": "<設立>", "rule": o_v_seturtu_dic},
        {"label": "<設立>", "rule": o_v_seturtu2_dic},
        {"label": "<組織変更>", "words": sohen_dic},
        {"label": "<組織変更>", "rule": o_v_sohen_dic},
        {"label": "<組織変更>", "rule": o_v_sohen2_dic},

        {"label": "<海外展開>", "words": kaigai_dic},
        {"label": "<海外展開>", "rule": o_v_kaigai_dic},

        {"label": "<設備投資>", "words": setubi_dic},
        {"label": "<設備投資>", "rule": o_v_setubi_dic},
        {"label": "<設備投資>", "rule": o_v_setubi2_dic},
        {"label": "<設備投資>", "rule": o_v_setubi3_dic},
        {"label": "<設備投資>", "rule": o_v_setubi4_dic},

        {"label": "<技術背景>", "words": gijyutsu_dic},
        {"label": "<社会情勢>", "words": shakai_dic},
        {"label": "<社会情勢>", "rule": o_v_shakai_dic},
        {"label": "<社会情勢>", "rule": o_v_shakai2_dic},
        {"label": "<社会情勢>", "rule": o_v_shakai3_dic},
        {"label": "<社会事件>", "words": jiken_dic},
        {"label": "<社会事件>", "rule": o_v_jiken_dic},
        {"label": "<社会事件>", "rule": o_v_jiken2_dic},
        {"label": "<社会事件>", "rule": o_v_jiken3_dic},
        {"label": "<社会事件>", "rule": o_v_jiken4_dic},
        {"label": "<社会事件>", "rule": o_v_jiken5_dic},
        {"label": "<社会問題>", "words": mondai_dic},
        {"label": "<社会問題>", "rule": o_v_mondai_dic},
        {"label": "<社会問題>", "rule": o_v_mondai2_dic},
        {"label": "<社会問題>", "rule": o_v_mondai3_dic},
        {"label": "<社会問題>", "rule": o_v_mondai4_dic},

        {"label": "<自然環境>", "words": kankyou_dic},
        {"label": "<自然環境>", "rule": o_v_kankyou_dic},
        {"label": "<自然環境>", "rule": o_v_kankyou2_dic},

        {"label": "<前提>", "words": zentei_dic},
        {"label": "<現象>", "words": gensyou_dic},
        {"label": "<効果>", "words": kouka_dic},
        {"label": "<背景>", "words": haikei_dic},
        {"label": "<背景>", "rule": v_m_haikei_dic},
        {"label": "<背景>", "rule": o_v_haikei_dic},
        {"label": "<背景>", "rule": o_v_haikei2_dic},
        {"label": "<背景>", "rule": o_v_haikei3_dic},

        # タイトル専用

        {"label": "<政府>", "words": seifu_dic},
        {"label": "<政府>", "rule": o_v_seifu_dic},
        {"label": "<政府>", "rule": o_v_seifu2_dic},
        {"label": "<経済>", "words": keizai_dic}

    ]

    # 補助述部でも政府活動と認めるカテゴリのルール
    sub_phrase_rule = [
        #        {"label": "", "words": }
    ]

    # 上位カテゴリの下位カテゴリへのマージルール
    merge_rule = [
        ["<セミナー>", "<イベント>"],
        ["<会議>", "<セミナー>"],
        ["<紹介>", "<セミナー>"],
        ["<コラム>", "<説明>"],
        ["<コラム>", "<提案>"],
        ["<コラム>", "<対策>"],
        # #["<コラム>", "<研究>"],
        # #["<コラム>", "<サービス開始>"],
        ["<サービス開始>", "<イベント>"],
        ["<人事>", "<サービス開始>"],
        ["<実験>", "<サービス開始>"],
        #        ["<実験>", "<コラム>"],
        # #["<方針>", "<サービス開始>"],
        # #["<方針>", "<技術開発>"],
        ["<社会事件>", "<技術開発>"],
        ["<社会事件>", "<スポーツ>"],
        ["<社会統計>", "<方針>"],
        # #["<情報公開>", "<サービス開始>"],
        ["<情報公開>", "<イベント>"],
        ["<研究>", "<コラム>"],
        ["<研究>", "<サービス開始>"],
        ["<研究>", "<社会統計>"],
        ["<市場データ>", "<イベント>"],
        ["<市場データ>", "<コラム>"],
        ["<募集>", "<コラム>"],
        # ["<技術開発>", "<コラム>"],
        ["<価格変更>", "<投資>"],
        ["<価格>", "<投資>"],
        ["<障害>", "<表彰>"],
        ["<市場動向>", "<社会情勢>"],
        ["<市場動向>", "<障害>"],
        ["<市場動向>", "<スポーツ>"],
        ["<組織変更>", "<技術開発>"],
        ["<会議>", "<技術開発>"],
        ["<政府・規制>", "<技術開発>"],
        ["<政府・行革>", "<社会事件>"],
        ["<政府・補助金>", "<価格>"],
        ["<技術開発>", "<政府・宣言>"],
        ["<技術開発>", "<社会統計>"],
        ["<生活>", "<芸能>"],
        ["<イベント>", "<生産活動>"]
    ]

    """
    本文の解析が不要なタグ
    """
    top_category = [
        "<スポーツ>",
        "<芸能>",
        "<芸能>",
        "<占い>",
        "<生活>",

        "<業界情報>",
        "<市場データ>",
        "<市場動向>",
        "<社会統計>",

        "<政府・予算>",
        "<政府・補助金>",
        "<政府・行革>",
        "<政府・認可>",
        "<政府・規制>",
        "<政府・宣言>",
        "<政府・会談>",

        "<要請>",
        "<契約>",
        "<法廷>",

        "<技術動向>",
        "<技術提供>",
        "<技術開発>",
        "<研究>",
        "<実験>",
        "<実験>",

        "<障害>",

        "<表彰>",
        "<特許>",

        "<業績>",

        "<提携>",
        "<譲渡・買収>",
        "<利用・採用>",

        "<サービス開始>",
        "<サービス更新>",
        "<サービス終了>",
        "<生産活動>",
        "<商品化>",
        "<営業活動>",
        "<受注>",

        "<価格変更>",
        "<価格>",

        "<税金>",

        "<相場>",

        "<為替>",

        "<株式概況>",

        "<人事>",
        "<組織>",
        "<設立>",
        "<組織変更>",

        "<海外展開>",

        "<設備投資>",

        "<社会情勢>",
        "<社会事件>",
        "<社会問題>",

        "<自然環境>"
    ]


    """
    時制に関する補助用言
    """
    kako = [""]
    genzai = [""]
    mirai = ["予定", "計画", "目指す"]
