[
"アマゾン。商品の仕分けできるAI活用した最新ロボット初披露。| NHK。",
"マスク氏、人型ロボット披露。「ターミネーター化」防止を約束。",
"LG OLED evo TV、世界最小型の42インチ台披露。",
"目玉は電動技術、コマツ・日立建機などが国際建機見本市で披露する技術力（ニュースイッチ）。",
"SMOORE、使い捨て技術ソリューション「FEELM Max」を披露。",
"SKT、MWC 2022で「未来ICT進化」披露する。",
"三井化学がマテリアルリサイクルで制作したベンチをお披露目。2022。ニュースリリース。三井化学株式会社。",
"日本最大の太陽光発電関連の展示会で最新の蓄電技術を披露。中国・ファーウェイ。",
"【。。自動翻訳記事】。。BOE、SID Display Week 2022で6分野のトレンド創造技術を披露。。 Flat Panel TV and Display World。2....液晶・業界・動向。",
"Tie2活性化や毛細血管、リンパ管など多角的な学術研究を披露。Tie2・リンパ・血管研究会学術集会。",
"ダイソン、家事を助けるロボットの「手」披露。食器やおもちゃの片付けも。",
"ホンダ製パワーユニット搭載の電動カートお披露目！F1ドライバー4人もその実力に大興奮！。。 TopNews。",
"ミシュランの星獲得シェフが3Dプリント料理を披露。",
"遊びではない「卓球ロボ」。オムロンが開発する理由はロボット展で最新型を初披露。|。電波新聞デジタル。",
"カルビー、森永乳業、理研ビタミン3社合同新商品発表会で、秋に向けた新商品を披露。",
"ＬＧ「ミニマルデザイン家電」をＣＥＳで披露。",
"川崎重工が披露した“近未来２輪車”の走り。",
"最後のジャンボ機、ボーイングがお披露目。アトラス向け747。8F貨物機、23年納入。",
"Artiluxが画期的なマルチスペクトル光学センシングを披露。紀伊民報AGARA。",
"「人とくるまのテクノロジー展2022 YOKOHAMA」開幕電子部品メーカー各社、最新技術を披露。|。電波新聞デジタル。",
"TP。Link、アンテナが動いて自動調整「AXE200 Omni」などWi。Fi 6Eルーターを披露。",
"【。。今日の1枚】。。先陣を切るロボット犬、政府要人にお披露目。独。",
"ヴァレオ、人とくるまのテクノロジー展2022にて、持続可能なモビリティへの4つのメガトレンドに関するイノベーションを披露。",
"日清食品「完全栄養食」。安藤社長が国際高血圧学会で研究成果を披露。。。食品新聞。WEB版（食品新聞社）。",
"日清食品「完全栄養食」。安藤社長が国際高血圧学会で研究成果を披露。",
"新デザインの親子戸など、新作10点をYoutubeライブでお披露目～フルハイトドアのKAMIYAがオンライン新作発表会を2月17日(木)・24日(木)開催～。",
"フランス産。新感覚。オーガニック。クラフト飲料「ル・コック・トケ。LE COQ TOQU !」日本初上陸、フランス大使公邸イベントで初披露。",
"WWDC 2022でお披露目される。Apple。の新製品をアナリストが予想。",
"日本郵便とACSL「物流専用ドローン」お披露目。。2023年度中に機体認証とレベル4飛行を。",
"ダイハツ、国産車のＥＶコンセプトを披露。インドネシア・自動車・二輪車。",
"水素式の熱風発生装置を初披露。",
"クアルコムが披露した次世代の5G、エッジAIロボティクスソリューション。",
"米アボットがウエアラブル新製品を披露生体情報をモニター、遠隔医療やDXも。|。電波新聞デジタル。",
"電子部品大手ニチコン。京都・亀岡に「家産家消」モデルハウス披露。。。ニュース。KBS京都。",
"ロボデックス、ドローン国際見本市で独自モデル披露。",
"メルセデス・ベンツの新型電気自動車「ＥＱＥ」、関西で初披露。≫。Lmaga.jp。",
"「革新鋼板」でオンライン講演会／高炉３社が成果披露。|。日刊鉄鋼新聞。Japan Metal Daily。",
"LG電子、「IEEE ICC」で未来モビリティの革新技術の披露。",
"『スプラトゥーン3』開発者インタビューでイカ世界の「地図」がお披露目。キャラクター「スパイキー」の成長など細かな設定と作り込みが移り変わる世界のリアルさを生み出す。",
"中外製薬、技術ドリブンの創薬戦略の成果を披露。",
"サムスン電子、「ホームオフィス最適化」スマートモニターを7日に初披露。",
"SKグループ、CESで約40の炭素削減技術を同時に披露する。",
"自動車技術を応用したエアモビリティの軽量キャビン、国際航空ショーで披露。",
"「米AMDと合作」サムスン電子、最強グラフィックモバイルAP「エクシノス2200」披露。",
"777X、急上昇・急旋回させダイナミックな飛行展示披露。ファンボロー航空ショー。",
"実物大νガンダム立像、お披露目。『ククルス・ドアンの島』に“アムロ”古谷徹「はっきり言って泣けます」。紀伊民報AGARA。",
"Facebook、ニューラルリストバンドの試作品を披露。",
"テレビも完全ワイヤレスに。。50cm離れても給電できる技術、Reasonanceが披露。",
"「宇宙の技術」で子どもの健康守る山火事検知のセンサーもCESで披露。|。電波新聞デジタル。",
"日産。サクラ。をメタバース上で試乗できる！。史上初、VRで新型車お披露目。",
"ＡＣＳＬ、日本およびインドの展示会で国産ドローンを披露。",
"トヨタのバスケロボ、B.LEAGUEで披露。ロングシュートやドリブル（Impress Watch）。",
"【。。福田昭のセミコン業界最前線】。。。Intel、IBM、AMDが次世代プロセッサの技術概要をISSCC 2022で披露。",
"セイコーインスツル、高周波スピンドルによる精密コマ四段回し挑戦の軌跡をPVで披露。fabcross。",
"Googleが「人間の言葉を理解して状況に応じて行動するお手伝いロボット」をお披露目。",
"ソニー、コスパ追求4Kカメラ「HDC。3200」などをNABで披露。",
"ヤマハ発動機が「モビリティ」と「ロボティクス」を融合させた高い技術力・提案力を披露【2022国際ロボット展（iREX2022）】。",
"つながったトンネルがお披露目。８割トンネル。抜けたらシェルター。北海道新幹線が見えるスポットはここだ（HTB北海道ニュース）。",
"サムスン電子、画質・サウンド・スマート機能強化した「Neo QLED」披露。",
"高難度のプロジェクトを成功に導く秘訣をオンラインで披露。",
"顔認証や遠隔操作も、新NC搭載のファイバーレーザーマシンなど3機種を国内初披露。JIMTOF2022。",
"カカオモビリティ。現代自、年内に都心自律走行モビリティモデルサービスの披露。",
"業務用ディスプレーは成長分野、ソニーが仮想スタジオなど商材披露。",
"環境への配慮とインテリジェンス。ズームライオン（Zoomlion）、バウマ2022（bauma 2022）で高所用プラットフォーム、土工用機器、フォークリフトの新製品を披露。",
"古河電工、光や音で歩行者に注意を喚起する歩道など披露。",
"栃木県鹿沼市の基幹産業である木工、金属加工、園芸がコラボレーションしたリラクゼーションブランド「KINOMA」が10月21日(金)に初お披露目。",
"J。Startup企業に選定された有望ベンチャー13社が、最先端技術をピッチで披露【第10回ILS】。",
"新エネルギー戦略フルスイング。GWMが成都モーターショー2022で複数の新エネルギーモデル披露。",
"JR東日本とトヨタが水素でコラボ。燃料電池車両「HYBARI」がお披露目。",
"GPT。3に対抗してAI2がQ&Aを重視したオープンなライバルAIを披露。",
"ダッソー・システムズ、CES 2023でライフサイエンスやモビリティにおけるバーチャルツインの最新事例を披露。",
"VWの中国法人、eVTOLの試作機「V.MO」を披露。。4人乗りで自律飛行し、航続距離200km。",
"3年ぶりにMWC参加するKT。AI・ロボット「デジタル革新の未来」披露する。",
"シェフラーがロボット、持続可能な技術、そして水素技術を披露。",
"コンサル「出世の秘訣」をビッグ4現役パートナーが披露！昇進を左右する“3つの分岐点”【動画】。",
"LGディスプレイ、伸縮可能な高解像度ディスプレイを披露。",
"BMW、ボタン1つで色が変わるクルマをCESで披露。(TechCrunch Japan)。",
"国際ロボット展で塗装自動化を披露。",
"Samsungが77”QD。OLEDをディスプレイ国際会議「IMID 2022」で初披露。",
"ドローン宅配、実用化へ前進。高性能の新機体披露。日本郵便など。時事ドットコム。",
"サレジオ高専、自動運転EV初披露。6～7日に都内で。",
"ドコモ、6Gに向けた最新技術を披露。。「置くだけアンテナ」や「人間拡張基盤」（CNET Japan）。",
"土木・建築ICT促進展/最新技術を披露/42の企業・団体が集結/片桐機械ほかイベント実行委。|。建設通信新聞Digital。",
"動画。中国の次世代ロボット「Ｏｌｌｉｅ」、見事なボールさばき披露。",
"世界初のNMN乳酸菌を食品開発展で披露目。",
"ヤマハ発動機がロボティクスとモビリティ分野の最新製品や技術を「2022国際ロボット展（iREX2022）」で披露。",
"アマゾン、物流倉庫の新型ロボットを披露。。完全自律型も。",
"【。。福田昭のセミコン業界最前線】。。。高性能プロセッサの祭典「Hot Chips 34」でIntel、AMD、NVIDIAが最新技術を披露。",
"RMGT IGAS2022でスマートアシストプリンティングによる印刷機の自動運転披露、3ジョブをノンストップ印刷～刷版供給システムも参考出品。",
"ハノーバーメッセで食品産業向けの持続可能なソリューションやロボット向けのイノベーションを披露。",
"フォルクスワーゲン、最高速度時速。20キロで走行できるオフィスチェアを披露。",
"ミリ波によるロボットワイヤレスなど、総務省「電波資源拡大のための研究開発」成果を披露。",
"AIチップのGraphcoreが披露した3Dプロセッサー。。\"ウルトラインテリジェンス\"マシンへの展望も。",
"燃料電池と自動運転のフォーク披露、トヨタL&F。",
"食器洗浄に必要な作業員を約半数に！。セントラルキッチン向けの画期的な洗浄システムを初披露。展示会「第1回。フードテックジャパン大阪」にて稼働実演。",
"京セラ、22年10月の事業化を目指すAIロボットシステムを披露。。 2022国際ロボット展。",
"ヤマハ発動機、新モビリティ三輪車「トリタウン」を初披露。自動車メーカー。紙面記事。",
"トヨタ自動車のイノベーションをオンラインで披露（参加無料）。",
"LG OLED evo、世界3大アートフェアで「NFT作品」披露。",
"ザッカーバーグ氏、音声コマンドでバーチャルワールドを作るデモを披露。",
"単独で固定翼モードに変形する独自ティルトローターVTOLおよび高感度カメラ搭載ドローン新シリーズを披露。",
"安川電機、変種変量や工程変化に対応する“自律分散型のものづくり”のデモを披露。",
"LGが「伸びるディスプレイ」を披露。12インチが14インチにのびーる。(ギズモード・ジャパン)。",
"DeLorean。の新型。EV Alpha5。の画像が初お披露目される。",
"ハンコック、エアレスタイヤ「アイレックス」をCESで披露。",
"ミリ波によるロボットワイヤレスなど、総務省「電波資源拡大のための研究開発」成果を披露",
"AIチップのGraphcoreが披露した3Dプロセッサー。。\"ウルトラインテリジェンス\"マシンへの展望も",
"燃料電池と自動運転のフォーク披露、トヨタL&F",
"食器洗浄に必要な作業員を約半数に！。セントラルキッチン向けの画期的な洗浄システムを初披露。展示会「第1回。フードテックジャパン大阪」にて稼働実演",
"京セラ、22年10月の事業化を目指すAIロボットシステムを披露。。 2022国際ロボット展",
"ヤマハ発動機、新モビリティ三輪車「トリタウン」を初披露。自動車メーカー。紙面記事",
"トヨタ自動車のイノベーションをオンラインで披露",
"LG OLED evo、世界3大アートフェアで「NFT作品」披露",
"ザッカーバーグ氏、音声コマンドでバーチャルワールドを作るデモを披露",
"単独で固定翼モードに変形する独自ティルトローターVTOLおよび高感度カメラ搭載ドローン新シリーズを披露",
"安川電機、変種変量や工程変化に対応する“自律分散型のものづくり”のデモを披露",
"LGが「伸びるディスプレイ」を披露。12インチが14インチにのびーる。",
"DeLorean。の新型。EV Alpha5。の画像が初お披露目される",
"ハンコック、エアレスタイヤ「アイレックス」をCESで披露"
]
